(this["webpackJsonp"] = this["webpackJsonp"] || []).push([
  [230, 229],
  {
    2762: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.toUtf8 =
          e.fromUtf8 =
          e.toRfc3339 =
          e.fromRfc3339 =
          e.toHex =
          e.fromHex =
          e.Bech32 =
          e.toBase64 =
          e.fromBase64 =
          e.toAscii =
          e.fromAscii =
            void 0));
      var o = r(3749);
      (Object.defineProperty(e, "fromAscii", {
        enumerable: !0,
        get: function () {
          return o.fromAscii;
        },
      }),
        Object.defineProperty(e, "toAscii", {
          enumerable: !0,
          get: function () {
            return o.toAscii;
          },
        }));
      var t = r(3750);
      (Object.defineProperty(e, "fromBase64", {
        enumerable: !0,
        get: function () {
          return t.fromBase64;
        },
      }),
        Object.defineProperty(e, "toBase64", {
          enumerable: !0,
          get: function () {
            return t.toBase64;
          },
        }));
      var i = r(3751);
      Object.defineProperty(e, "Bech32", {
        enumerable: !0,
        get: function () {
          return i.Bech32;
        },
      });
      var n = r(3752);
      (Object.defineProperty(e, "fromHex", {
        enumerable: !0,
        get: function () {
          return n.fromHex;
        },
      }),
        Object.defineProperty(e, "toHex", {
          enumerable: !0,
          get: function () {
            return n.toHex;
          },
        }));
      var s = r(3753);
      (Object.defineProperty(e, "fromRfc3339", {
        enumerable: !0,
        get: function () {
          return s.fromRfc3339;
        },
      }),
        Object.defineProperty(e, "toRfc3339", {
          enumerable: !0,
          get: function () {
            return s.toRfc3339;
          },
        }));
      var c = r(3754);
      (Object.defineProperty(e, "fromUtf8", {
        enumerable: !0,
        get: function () {
          return c.fromUtf8;
        },
      }),
        Object.defineProperty(e, "toUtf8", {
          enumerable: !0,
          get: function () {
            return c.toUtf8;
          },
        }));
    },
    2796: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.Uint64 = e.Uint53 = e.Uint32 = e.Int53 = e.Decimal = void 0));
      var o = r(3776);
      Object.defineProperty(e, "Decimal", {
        enumerable: !0,
        get: function () {
          return o.Decimal;
        },
      });
      var t = r(3777);
      (Object.defineProperty(e, "Int53", {
        enumerable: !0,
        get: function () {
          return t.Int53;
        },
      }),
        Object.defineProperty(e, "Uint32", {
          enumerable: !0,
          get: function () {
            return t.Uint32;
          },
        }),
        Object.defineProperty(e, "Uint53", {
          enumerable: !0,
          get: function () {
            return t.Uint53;
          },
        }),
        Object.defineProperty(e, "Uint64", {
          enumerable: !0,
          get: function () {
            return t.Uint64;
          },
        }));
    },
    2968: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.executeKdf =
          e.makeSignDoc =
          e.makeSignBytes =
          e.makeAuthInfoBytes =
          e.isOfflineDirectSigner =
          e.encodePubkey =
          e.decodePubkey =
          e.makeCosmoshubPath =
          e.DirectSecp256k1Wallet =
          e.DirectSecp256k1HdWallet =
          e.extractKdfConfiguration =
          e.Registry =
          e.isTsProtoGeneratedType =
          e.isPbjsGeneratedType =
          e.isTxBodyEncodeObject =
          e.decodeTxRaw =
          e.parseCoins =
          e.coins =
          e.coin =
            void 0));
      var o = r(2910);
      (Object.defineProperty(e, "coin", {
        enumerable: !0,
        get: function () {
          return o.coin;
        },
      }),
        Object.defineProperty(e, "coins", {
          enumerable: !0,
          get: function () {
            return o.coins;
          },
        }));
      var t = r(3782);
      Object.defineProperty(e, "parseCoins", {
        enumerable: !0,
        get: function () {
          return t.parseCoins;
        },
      });
      var i = r(3783);
      Object.defineProperty(e, "decodeTxRaw", {
        enumerable: !0,
        get: function () {
          return i.decodeTxRaw;
        },
      });
      var n = r(3784);
      (Object.defineProperty(e, "isTxBodyEncodeObject", {
        enumerable: !0,
        get: function () {
          return n.isTxBodyEncodeObject;
        },
      }),
        Object.defineProperty(e, "isPbjsGeneratedType", {
          enumerable: !0,
          get: function () {
            return n.isPbjsGeneratedType;
          },
        }),
        Object.defineProperty(e, "isTsProtoGeneratedType", {
          enumerable: !0,
          get: function () {
            return n.isTsProtoGeneratedType;
          },
        }),
        Object.defineProperty(e, "Registry", {
          enumerable: !0,
          get: function () {
            return n.Registry;
          },
        }));
      var s = r(3785);
      (Object.defineProperty(e, "extractKdfConfiguration", {
        enumerable: !0,
        get: function () {
          return s.extractKdfConfiguration;
        },
      }),
        Object.defineProperty(e, "DirectSecp256k1HdWallet", {
          enumerable: !0,
          get: function () {
            return s.DirectSecp256k1HdWallet;
          },
        }));
      var c = r(3786);
      Object.defineProperty(e, "DirectSecp256k1Wallet", {
        enumerable: !0,
        get: function () {
          return c.DirectSecp256k1Wallet;
        },
      });
      var l = r(3787);
      Object.defineProperty(e, "makeCosmoshubPath", {
        enumerable: !0,
        get: function () {
          return l.makeCosmoshubPath;
        },
      });
      var u = r(3788);
      (Object.defineProperty(e, "decodePubkey", {
        enumerable: !0,
        get: function () {
          return u.decodePubkey;
        },
      }),
        Object.defineProperty(e, "encodePubkey", {
          enumerable: !0,
          get: function () {
            return u.encodePubkey;
          },
        }));
      var d = r(3791);
      Object.defineProperty(e, "isOfflineDirectSigner", {
        enumerable: !0,
        get: function () {
          return d.isOfflineDirectSigner;
        },
      });
      var p = r(3119);
      (Object.defineProperty(e, "makeAuthInfoBytes", {
        enumerable: !0,
        get: function () {
          return p.makeAuthInfoBytes;
        },
      }),
        Object.defineProperty(e, "makeSignBytes", {
          enumerable: !0,
          get: function () {
            return p.makeSignBytes;
          },
        }),
        Object.defineProperty(e, "makeSignDoc", {
          enumerable: !0,
          get: function () {
            return p.makeSignDoc;
          },
        }));
      var m = r(3322);
      Object.defineProperty(e, "executeKdf", {
        enumerable: !0,
        get: function () {
          return m.executeKdf;
        },
      });
    },
    3119: function (a, e, r) {
      "use strict";
      var o =
        (this && this.__importDefault) ||
        function (a) {
          return a && a.__esModule ? a : { default: a };
        };
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.makeSignBytes = e.makeSignDoc = e.makeAuthInfoBytes = void 0));
      const t = r(3063),
        i = r(2937),
        n = o(r(2754));
      function s(a, e) {
        return a.map((a) => {
          let { pubkey: r, sequence: o } = a;
          return {
            publicKey: r,
            modeInfo: { single: { mode: e } },
            sequence: n.default.fromNumber(o),
          };
        });
      }
      function c(a, e, r, o) {
        void 0 === o && (o = t.SignMode.SIGN_MODE_DIRECT);
        const c = {
          signerInfos: s(a, o),
          fee: { amount: [...e], gasLimit: n.default.fromNumber(r) },
        };
        return i.AuthInfo.encode(i.AuthInfo.fromPartial(c)).finish();
      }
      function l(a, e, r, o) {
        return {
          bodyBytes: a,
          authInfoBytes: e,
          chainId: r,
          accountNumber: n.default.fromNumber(o),
        };
      }
      function u(a) {
        let {
          accountNumber: e,
          authInfoBytes: r,
          bodyBytes: o,
          chainId: t,
        } = a;
        const n = i.SignDoc.fromPartial({
          accountNumber: e,
          authInfoBytes: r,
          bodyBytes: o,
          chainId: t,
        });
        return i.SignDoc.encode(n).finish();
      }
      ((e.makeAuthInfoBytes = c), (e.makeSignDoc = l), (e.makeSignBytes = u));
    },
    3322: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.decrypt =
          e.encrypt =
          e.supportedAlgorithms =
          e.executeKdf =
          e.cosmjsSalt =
            void 0));
      const o = r(2800),
        t = r(2762);
      async function i(a, r) {
        switch (r.algorithm) {
          case "argon2id": {
            const t = r.params;
            if (!o.isArgon2idOptions(t))
              throw new Error("Invalid format of argon2id params");
            return o.Argon2id.execute(a, e.cosmjsSalt, t);
          }
          default:
            throw new Error("Unsupported KDF algorithm");
        }
      }
      async function n(a, r, t) {
        switch (t.algorithm) {
          case e.supportedAlgorithms.xchacha20poly1305Ietf: {
            const e = o.Random.getBytes(o.xchacha20NonceLength);
            return new Uint8Array([
              ...e,
              ...(await o.Xchacha20poly1305Ietf.encrypt(a, r, e)),
            ]);
          }
          default:
            throw new Error(
              `Unsupported encryption algorithm: '${t.algorithm}'`,
            );
        }
      }
      async function s(a, r, t) {
        switch (t.algorithm) {
          case e.supportedAlgorithms.xchacha20poly1305Ietf: {
            const e = a.slice(0, o.xchacha20NonceLength);
            return o.Xchacha20poly1305Ietf.decrypt(
              a.slice(o.xchacha20NonceLength),
              r,
              e,
            );
          }
          default:
            throw new Error(
              `Unsupported encryption algorithm: '${t.algorithm}'`,
            );
        }
      }
      ((e.cosmjsSalt = t.toAscii("The CosmJS salt.")),
        (e.executeKdf = i),
        (e.supportedAlgorithms = {
          xchacha20poly1305Ietf: "xchacha20poly1305-ietf",
        }),
        (e.encrypt = n),
        (e.decrypt = s));
    },
    3578: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.jsonRpcCode =
          e.isJsonRpcSuccessResponse =
          e.isJsonRpcErrorResponse =
          e.parseJsonRpcSuccessResponse =
          e.parseJsonRpcErrorResponse =
          e.parseJsonRpcResponse =
          e.parseJsonRpcRequest =
          e.parseJsonRpcId =
          e.JsonRpcClient =
          e.makeJsonRpcId =
            void 0));
      var o = r(4448);
      Object.defineProperty(e, "makeJsonRpcId", {
        enumerable: !0,
        get: function () {
          return o.makeJsonRpcId;
        },
      });
      var t = r(4449);
      Object.defineProperty(e, "JsonRpcClient", {
        enumerable: !0,
        get: function () {
          return t.JsonRpcClient;
        },
      });
      var i = r(4450);
      (Object.defineProperty(e, "parseJsonRpcId", {
        enumerable: !0,
        get: function () {
          return i.parseJsonRpcId;
        },
      }),
        Object.defineProperty(e, "parseJsonRpcRequest", {
          enumerable: !0,
          get: function () {
            return i.parseJsonRpcRequest;
          },
        }),
        Object.defineProperty(e, "parseJsonRpcResponse", {
          enumerable: !0,
          get: function () {
            return i.parseJsonRpcResponse;
          },
        }),
        Object.defineProperty(e, "parseJsonRpcErrorResponse", {
          enumerable: !0,
          get: function () {
            return i.parseJsonRpcErrorResponse;
          },
        }),
        Object.defineProperty(e, "parseJsonRpcSuccessResponse", {
          enumerable: !0,
          get: function () {
            return i.parseJsonRpcSuccessResponse;
          },
        }));
      var n = r(3579);
      (Object.defineProperty(e, "isJsonRpcErrorResponse", {
        enumerable: !0,
        get: function () {
          return n.isJsonRpcErrorResponse;
        },
      }),
        Object.defineProperty(e, "isJsonRpcSuccessResponse", {
          enumerable: !0,
          get: function () {
            return n.isJsonRpcSuccessResponse;
          },
        }),
        Object.defineProperty(e, "jsonRpcCode", {
          enumerable: !0,
          get: function () {
            return n.jsonRpcCode;
          },
        }));
    },
    3579: function (a, e, r) {
      "use strict";
      function o(a) {
        return "object" === typeof a.error;
      }
      function t(a) {
        return !o(a);
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.jsonRpcCode =
          e.isJsonRpcSuccessResponse =
          e.isJsonRpcErrorResponse =
            void 0),
        (e.isJsonRpcErrorResponse = o),
        (e.isJsonRpcSuccessResponse = t),
        (e.jsonRpcCode = {
          parseError: -32700,
          invalidRequest: -32600,
          methodNotFound: -32601,
          invalidParams: -32602,
          internalError: -32603,
          serverError: { default: -32e3 },
        }));
    },
    3749: function (a, e, r) {
      "use strict";
      function o(a) {
        const e = (a) =>
          a.split("").map((a) => {
            const e = a.charCodeAt(0);
            if (e < 32 || e > 126)
              throw new Error(
                "Cannot encode character that is out of printable ASCII range: " +
                  e,
              );
            return e;
          });
        return Uint8Array.from(e(a));
      }
      function t(a) {
        const e = (a) =>
          a.map((a) => {
            if (a < 32 || a > 126)
              throw new Error(
                "Cannot decode character that is out of printable ASCII range: " +
                  a,
              );
            return String.fromCharCode(a);
          });
        return e(Array.from(a)).join("");
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.fromAscii = e.toAscii = void 0),
        (e.toAscii = o),
        (e.fromAscii = t));
    },
    3750: function (a, e, r) {
      "use strict";
      var o =
          (this && this.__createBinding) ||
          (Object.create
            ? function (a, e, r, o) {
                (void 0 === o && (o = r),
                  Object.defineProperty(a, o, {
                    enumerable: !0,
                    get: function () {
                      return e[r];
                    },
                  }));
              }
            : function (a, e, r, o) {
                (void 0 === o && (o = r), (a[o] = e[r]));
              }),
        t =
          (this && this.__setModuleDefault) ||
          (Object.create
            ? function (a, e) {
                Object.defineProperty(a, "default", {
                  enumerable: !0,
                  value: e,
                });
              }
            : function (a, e) {
                a["default"] = e;
              }),
        i =
          (this && this.__importStar) ||
          function (a) {
            if (a && a.__esModule) return a;
            var e = {};
            if (null != a)
              for (var r in a)
                "default" !== r &&
                  Object.prototype.hasOwnProperty.call(a, r) &&
                  o(e, a, r);
            return (t(e, a), e);
          };
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.fromBase64 = e.toBase64 = void 0));
      const n = i(r(812));
      function s(a) {
        return n.fromByteArray(a);
      }
      function c(a) {
        if (!a.match(/^[a-zA-Z0-9+/]*={0,2}$/))
          throw new Error("Invalid base64 string format");
        return n.toByteArray(a);
      }
      ((e.toBase64 = s), (e.fromBase64 = c));
    },
    3751: function (a, e, r) {
      "use strict";
      var o =
          (this && this.__createBinding) ||
          (Object.create
            ? function (a, e, r, o) {
                (void 0 === o && (o = r),
                  Object.defineProperty(a, o, {
                    enumerable: !0,
                    get: function () {
                      return e[r];
                    },
                  }));
              }
            : function (a, e, r, o) {
                (void 0 === o && (o = r), (a[o] = e[r]));
              }),
        t =
          (this && this.__setModuleDefault) ||
          (Object.create
            ? function (a, e) {
                Object.defineProperty(a, "default", {
                  enumerable: !0,
                  value: e,
                });
              }
            : function (a, e) {
                a["default"] = e;
              }),
        i =
          (this && this.__importStar) ||
          function (a) {
            if (a && a.__esModule) return a;
            var e = {};
            if (null != a)
              for (var r in a)
                "default" !== r &&
                  Object.prototype.hasOwnProperty.call(a, r) &&
                  o(e, a, r);
            return (t(e, a), e);
          };
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.Bech32 = void 0));
      const n = i(r(803));
      class Bech32 {
        static encode(a, e, r) {
          const o = n.encode(a, n.toWords(e), r);
          return o;
        }
        static decode(a, e) {
          void 0 === e && (e = 1 / 0);
          const r = n.decode(a, e);
          return {
            prefix: r.prefix,
            data: new Uint8Array(n.fromWords(r.words)),
          };
        }
      }
      e.Bech32 = Bech32;
    },
    3752: function (a, e, r) {
      "use strict";
      function o(a) {
        let e = "";
        for (const r of a) e += ("0" + r.toString(16)).slice(-2);
        return e;
      }
      function t(a) {
        if (a.length % 2 !== 0)
          throw new Error("hex string length must be a multiple of 2");
        const e = [];
        for (let r = 0; r < a.length; r += 2) {
          const o = a.substr(r, 2);
          if (!o.match(/[0-9a-f]{2}/i))
            throw new Error("hex string contains invalid characters");
          e.push(parseInt(o, 16));
        }
        return new Uint8Array(e);
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.fromHex = e.toHex = void 0),
        (e.toHex = o),
        (e.fromHex = t));
    },
    3753: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.toRfc3339 = e.fromRfc3339 = void 0));
      const o =
        /^(\d{4})-(\d{2})-(\d{2})[T ](\d{2}):(\d{2}):(\d{2})(\.\d{1,9})?((?:[+-]\d{2}:\d{2})|Z)$/;
      function t(a, e) {
        void 0 === e && (e = 2);
        const r = "00000" + a.toString();
        return r.substring(r.length - e);
      }
      function i(a) {
        const e = o.exec(a);
        if (!e) throw new Error("Date string is not in RFC3339 format");
        const r = +e[1],
          t = +e[2],
          i = +e[3],
          n = +e[4],
          s = +e[5],
          c = +e[6],
          l = e[7] ? Math.floor(1e3 * +e[7]) : 0;
        let u, d, p;
        "Z" === e[8]
          ? ((u = 1), (d = 0), (p = 0))
          : ((u = "-" === e[8].substring(0, 1) ? -1 : 1),
            (d = +e[8].substring(1, 3)),
            (p = +e[8].substring(4, 6)));
        const m = u * (60 * d + p) * 60,
          f = Date.UTC(r, t - 1, i, n, s, c, l) - 1e3 * m;
        return new Date(f);
      }
      function n(a) {
        const e = a.getUTCFullYear(),
          r = t(a.getUTCMonth() + 1),
          o = t(a.getUTCDate()),
          i = t(a.getUTCHours()),
          n = t(a.getUTCMinutes()),
          s = t(a.getUTCSeconds()),
          c = t(a.getUTCMilliseconds(), 3);
        return `${e}-${r}-${o}T${i}:${n}:${s}.${c}Z`;
      }
      ((e.fromRfc3339 = i), (e.toRfc3339 = n));
    },
    3754: function (a, e, r) {
      "use strict";
      function o(a) {
        return new TextEncoder().encode(a);
      }
      function t(a) {
        return new TextDecoder("utf-8", { fatal: !0 }).decode(a);
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.fromUtf8 = e.toUtf8 = void 0),
        (e.toUtf8 = o),
        (e.fromUtf8 = t));
    },
    3758: function (a) {
      a.exports = JSON.parse(
        '["가격","가끔","가난","가능","가득","가르침","가뭄","가방","가상","가슴","가운데","가을","가이드","가입","가장","가정","가족","가죽","각오","각자","간격","간부","간섭","간장","간접","간판","갈등","갈비","갈색","갈증","감각","감기","감소","감수성","감자","감정","갑자기","강남","강당","강도","강력히","강변","강북","강사","강수량","강아지","강원도","강의","강제","강조","같이","개구리","개나리","개방","개별","개선","개성","개인","객관적","거실","거액","거울","거짓","거품","걱정","건강","건물","건설","건조","건축","걸음","검사","검토","게시판","게임","겨울","견해","결과","결국","결론","결석","결승","결심","결정","결혼","경계","경고","경기","경력","경복궁","경비","경상도","경영","경우","경쟁","경제","경주","경찰","경치","경향","경험","계곡","계단","계란","계산","계속","계약","계절","계층","계획","고객","고구려","고궁","고급","고등학생","고무신","고민","고양이","고장","고전","고집","고춧가루","고통","고향","곡식","골목","골짜기","골프","공간","공개","공격","공군","공급","공기","공동","공무원","공부","공사","공식","공업","공연","공원","공장","공짜","공책","공통","공포","공항","공휴일","과목","과일","과장","과정","과학","관객","관계","관광","관념","관람","관련","관리","관습","관심","관점","관찰","광경","광고","광장","광주","괴로움","굉장히","교과서","교문","교복","교실","교양","교육","교장","교직","교통","교환","교훈","구경","구름","구멍","구별","구분","구석","구성","구속","구역","구입","구청","구체적","국가","국기","국내","국립","국물","국민","국수","국어","국왕","국적","국제","국회","군대","군사","군인","궁극적","권리","권위","권투","귀국","귀신","규정","규칙","균형","그날","그냥","그늘","그러나","그룹","그릇","그림","그제서야","그토록","극복","극히","근거","근교","근래","근로","근무","근본","근원","근육","근처","글씨","글자","금강산","금고","금년","금메달","금액","금연","금요일","금지","긍정적","기간","기관","기념","기능","기독교","기둥","기록","기름","기법","기본","기분","기쁨","기숙사","기술","기억","기업","기온","기운","기원","기적","기준","기침","기혼","기획","긴급","긴장","길이","김밥","김치","김포공항","깍두기","깜빡","깨달음","깨소금","껍질","꼭대기","꽃잎","나들이","나란히","나머지","나물","나침반","나흘","낙엽","난방","날개","날씨","날짜","남녀","남대문","남매","남산","남자","남편","남학생","낭비","낱말","내년","내용","내일","냄비","냄새","냇물","냉동","냉면","냉방","냉장고","넥타이","넷째","노동","노란색","노력","노인","녹음","녹차","녹화","논리","논문","논쟁","놀이","농구","농담","농민","농부","농업","농장","농촌","높이","눈동자","눈물","눈썹","뉴욕","느낌","늑대","능동적","능력","다방","다양성","다음","다이어트","다행","단계","단골","단독","단맛","단순","단어","단위","단점","단체","단추","단편","단풍","달걀","달러","달력","달리","닭고기","담당","담배","담요","담임","답변","답장","당근","당분간","당연히","당장","대규모","대낮","대단히","대답","대도시","대략","대량","대륙","대문","대부분","대신","대응","대장","대전","대접","대중","대책","대출","대충","대통령","대학","대한민국","대합실","대형","덩어리","데이트","도대체","도덕","도둑","도망","도서관","도심","도움","도입","도자기","도저히","도전","도중","도착","독감","독립","독서","독일","독창적","동화책","뒷모습","뒷산","딸아이","마누라","마늘","마당","마라톤","마련","마무리","마사지","마약","마요네즈","마을","마음","마이크","마중","마지막","마찬가지","마찰","마흔","막걸리","막내","막상","만남","만두","만세","만약","만일","만점","만족","만화","많이","말기","말씀","말투","맘대로","망원경","매년","매달","매력","매번","매스컴","매일","매장","맥주","먹이","먼저","먼지","멀리","메일","며느리","며칠","면담","멸치","명단","명령","명예","명의","명절","명칭","명함","모금","모니터","모델","모든","모범","모습","모양","모임","모조리","모집","모퉁이","목걸이","목록","목사","목소리","목숨","목적","목표","몰래","몸매","몸무게","몸살","몸속","몸짓","몸통","몹시","무관심","무궁화","무더위","무덤","무릎","무슨","무엇","무역","무용","무조건","무지개","무척","문구","문득","문법","문서","문제","문학","문화","물가","물건","물결","물고기","물론","물리학","물음","물질","물체","미국","미디어","미사일","미술","미역","미용실","미움","미인","미팅","미혼","민간","민족","민주","믿음","밀가루","밀리미터","밑바닥","바가지","바구니","바나나","바늘","바닥","바닷가","바람","바이러스","바탕","박물관","박사","박수","반대","반드시","반말","반발","반성","반응","반장","반죽","반지","반찬","받침","발가락","발걸음","발견","발달","발레","발목","발바닥","발생","발음","발자국","발전","발톱","발표","밤하늘","밥그릇","밥맛","밥상","밥솥","방금","방면","방문","방바닥","방법","방송","방식","방안","방울","방지","방학","방해","방향","배경","배꼽","배달","배드민턴","백두산","백색","백성","백인","백제","백화점","버릇","버섯","버튼","번개","번역","번지","번호","벌금","벌레","벌써","범위","범인","범죄","법률","법원","법적","법칙","베이징","벨트","변경","변동","변명","변신","변호사","변화","별도","별명","별일","병실","병아리","병원","보관","보너스","보라색","보람","보름","보상","보안","보자기","보장","보전","보존","보통","보편적","보험","복도","복사","복숭아","복습","볶음","본격적","본래","본부","본사","본성","본인","본질","볼펜","봉사","봉지","봉투","부근","부끄러움","부담","부동산","부문","부분","부산","부상","부엌","부인","부작용","부장","부정","부족","부지런히","부친","부탁","부품","부회장","북부","북한","분노","분량","분리","분명","분석","분야","분위기","분필","분홍색","불고기","불과","불교","불꽃","불만","불법","불빛","불안","불이익","불행","브랜드","비극","비난","비닐","비둘기","비디오","비로소","비만","비명","비밀","비바람","비빔밥","비상","비용","비율","비중","비타민","비판","빌딩","빗물","빗방울","빗줄기","빛깔","빨간색","빨래","빨리","사건","사계절","사나이","사냥","사람","사랑","사립","사모님","사물","사방","사상","사생활","사설","사슴","사실","사업","사용","사월","사장","사전","사진","사촌","사춘기","사탕","사투리","사흘","산길","산부인과","산업","산책","살림","살인","살짝","삼계탕","삼국","삼십","삼월","삼촌","상관","상금","상대","상류","상반기","상상","상식","상업","상인","상자","상점","상처","상추","상태","상표","상품","상황","새벽","색깔","색연필","생각","생명","생물","생방송","생산","생선","생신","생일","생활","서랍","서른","서명","서민","서비스","서양","서울","서적","서점","서쪽","서클","석사","석유","선거","선물","선배","선생","선수","선원","선장","선전","선택","선풍기","설거지","설날","설렁탕","설명","설문","설사","설악산","설치","설탕","섭씨","성공","성당","성명","성별","성인","성장","성적","성질","성함","세금","세미나","세상","세월","세종대왕","세탁","센터","센티미터","셋째","소규모","소극적","소금","소나기","소년","소득","소망","소문","소설","소속","소아과","소용","소원","소음","소중히","소지품","소질","소풍","소형","속담","속도","속옷","손가락","손길","손녀","손님","손등","손목","손뼉","손실","손질","손톱","손해","솔직히","솜씨","송아지","송이","송편","쇠고기","쇼핑","수건","수년","수단","수돗물","수동적","수면","수명","수박","수상","수석","수술","수시로","수업","수염","수영","수입","수준","수집","수출","수컷","수필","수학","수험생","수화기","숙녀","숙소","숙제","순간","순서","순수","순식간","순위","숟가락","술병","술집","숫자","스님","스물","스스로","스승","스웨터","스위치","스케이트","스튜디오","스트레스","스포츠","슬쩍","슬픔","습관","습기","승객","승리","승부","승용차","승진","시각","시간","시골","시금치","시나리오","시댁","시리즈","시멘트","시민","시부모","시선","시설","시스템","시아버지","시어머니","시월","시인","시일","시작","시장","시절","시점","시중","시즌","시집","시청","시합","시험","식구","식기","식당","식량","식료품","식물","식빵","식사","식생활","식초","식탁","식품","신고","신규","신념","신문","신발","신비","신사","신세","신용","신제품","신청","신체","신화","실감","실내","실력","실례","실망","실수","실습","실시","실장","실정","실질적","실천","실체","실컷","실태","실패","실험","실현","심리","심부름","심사","심장","심정","심판","쌍둥이","씨름","씨앗","아가씨","아나운서","아드님","아들","아쉬움","아스팔트","아시아","아울러","아저씨","아줌마","아직","아침","아파트","아프리카","아픔","아홉","아흔","악기","악몽","악수","안개","안경","안과","안내","안녕","안동","안방","안부","안주","알루미늄","알코올","암시","암컷","압력","앞날","앞문","애인","애정","액수","앨범","야간","야단","야옹","약간","약국","약속","약수","약점","약품","약혼녀","양념","양력","양말","양배추","양주","양파","어둠","어려움","어른","어젯밤","어쨌든","어쩌다가","어쩐지","언니","언덕","언론","언어","얼굴","얼른","얼음","얼핏","엄마","업무","업종","업체","엉덩이","엉망","엉터리","엊그제","에너지","에어컨","엔진","여건","여고생","여관","여군","여권","여대생","여덟","여동생","여든","여론","여름","여섯","여성","여왕","여인","여전히","여직원","여학생","여행","역사","역시","역할","연결","연구","연극","연기","연락","연설","연세","연속","연습","연애","연예인","연인","연장","연주","연출","연필","연합","연휴","열기","열매","열쇠","열심히","열정","열차","열흘","염려","엽서","영국","영남","영상","영양","영역","영웅","영원히","영하","영향","영혼","영화","옆구리","옆방","옆집","예감","예금","예방","예산","예상","예선","예술","예습","예식장","예약","예전","예절","예정","예컨대","옛날","오늘","오락","오랫동안","오렌지","오로지","오른발","오븐","오십","오염","오월","오전","오직","오징어","오페라","오피스텔","오히려","옥상","옥수수","온갖","온라인","온몸","온종일","온통","올가을","올림픽","올해","옷차림","와이셔츠","와인","완성","완전","왕비","왕자","왜냐하면","왠지","외갓집","외국","외로움","외삼촌","외출","외침","외할머니","왼발","왼손","왼쪽","요금","요일","요즘","요청","용기","용서","용어","우산","우선","우승","우연히","우정","우체국","우편","운동","운명","운반","운전","운행","울산","울음","움직임","웃어른","웃음","워낙","원고","원래","원서","원숭이","원인","원장","원피스","월급","월드컵","월세","월요일","웨이터","위반","위법","위성","위원","위험","위협","윗사람","유난히","유럽","유명","유물","유산","유적","유치원","유학","유행","유형","육군","육상","육십","육체","은행","음력","음료","음반","음성","음식","음악","음주","의견","의논","의문","의복","의식","의심","의외로","의욕","의원","의학","이것","이곳","이념","이놈","이달","이대로","이동","이렇게","이력서","이론적","이름","이민","이발소","이별","이불","이빨","이상","이성","이슬","이야기","이용","이웃","이월","이윽고","이익","이전","이중","이튿날","이틀","이혼","인간","인격","인공","인구","인근","인기","인도","인류","인물","인생","인쇄","인연","인원","인재","인종","인천","인체","인터넷","인하","인형","일곱","일기","일단","일대","일등","일반","일본","일부","일상","일생","일손","일요일","일월","일정","일종","일주일","일찍","일체","일치","일행","일회용","임금","임무","입대","입력","입맛","입사","입술","입시","입원","입장","입학","자가용","자격","자극","자동","자랑","자부심","자식","자신","자연","자원","자율","자전거","자정","자존심","자판","작가","작년","작성","작업","작용","작은딸","작품","잔디","잔뜩","잔치","잘못","잠깐","잠수함","잠시","잠옷","잠자리","잡지","장관","장군","장기간","장래","장례","장르","장마","장면","장모","장미","장비","장사","장소","장식","장애인","장인","장점","장차","장학금","재능","재빨리","재산","재생","재작년","재정","재채기","재판","재학","재활용","저것","저고리","저곳","저녁","저런","저렇게","저번","저울","저절로","저축","적극","적당히","적성","적용","적응","전개","전공","전기","전달","전라도","전망","전문","전반","전부","전세","전시","전용","전자","전쟁","전주","전철","전체","전통","전혀","전후","절대","절망","절반","절약","절차","점검","점수","점심","점원","점점","점차","접근","접시","접촉","젓가락","정거장","정도","정류장","정리","정말","정면","정문","정반대","정보","정부","정비","정상","정성","정오","정원","정장","정지","정치","정확히","제공","제과점","제대로","제목","제발","제법","제삿날","제안","제일","제작","제주도","제출","제품","제한","조각","조건","조금","조깅","조명","조미료","조상","조선","조용히","조절","조정","조직","존댓말","존재","졸업","졸음","종교","종로","종류","종소리","종업원","종종","종합","좌석","죄인","주관적","주름","주말","주머니","주먹","주문","주민","주방","주변","주식","주인","주일","주장","주전자","주택","준비","줄거리","줄기","줄무늬","중간","중계방송","중국","중년","중단","중독","중반","중부","중세","중소기업","중순","중앙","중요","중학교","즉석","즉시","즐거움","증가","증거","증권","증상","증세","지각","지갑","지경","지극히","지금","지급","지능","지름길","지리산","지방","지붕","지식","지역","지우개","지원","지적","지점","지진","지출","직선","직업","직원","직장","진급","진동","진로","진료","진리","진짜","진찰","진출","진통","진행","질문","질병","질서","짐작","집단","집안","집중","짜증","찌꺼기","차남","차라리","차량","차림","차별","차선","차츰","착각","찬물","찬성","참가","참기름","참새","참석","참여","참외","참조","찻잔","창가","창고","창구","창문","창밖","창작","창조","채널","채점","책가방","책방","책상","책임","챔피언","처벌","처음","천국","천둥","천장","천재","천천히","철도","철저히","철학","첫날","첫째","청년","청바지","청소","청춘","체계","체력","체온","체육","체중","체험","초등학생","초반","초밥","초상화","초순","초여름","초원","초저녁","초점","초청","초콜릿","촛불","총각","총리","총장","촬영","최근","최상","최선","최신","최악","최종","추석","추억","추진","추천","추측","축구","축소","축제","축하","출근","출발","출산","출신","출연","출입","출장","출판","충격","충고","충돌","충분히","충청도","취업","취직","취향","치약","친구","친척","칠십","칠월","칠판","침대","침묵","침실","칫솔","칭찬","카메라","카운터","칼국수","캐릭터","캠퍼스","캠페인","커튼","컨디션","컬러","컴퓨터","코끼리","코미디","콘서트","콜라","콤플렉스","콩나물","쾌감","쿠데타","크림","큰길","큰딸","큰소리","큰아들","큰어머니","큰일","큰절","클래식","클럽","킬로","타입","타자기","탁구","탁자","탄생","태권도","태양","태풍","택시","탤런트","터널","터미널","테니스","테스트","테이블","텔레비전","토론","토마토","토요일","통계","통과","통로","통신","통역","통일","통장","통제","통증","통합","통화","퇴근","퇴원","퇴직금","튀김","트럭","특급","특별","특성","특수","특징","특히","튼튼히","티셔츠","파란색","파일","파출소","판결","판단","판매","판사","팔십","팔월","팝송","패션","팩스","팩시밀리","팬티","퍼센트","페인트","편견","편의","편지","편히","평가","평균","평생","평소","평양","평일","평화","포스터","포인트","포장","포함","표면","표정","표준","표현","품목","품질","풍경","풍속","풍습","프랑스","프린터","플라스틱","피곤","피망","피아노","필름","필수","필요","필자","필통","핑계","하느님","하늘","하드웨어","하룻밤","하반기","하숙집","하순","하여튼","하지만","하천","하품","하필","학과","학교","학급","학기","학년","학력","학번","학부모","학비","학생","학술","학습","학용품","학원","학위","학자","학점","한계","한글","한꺼번에","한낮","한눈","한동안","한때","한라산","한마디","한문","한번","한복","한식","한여름","한쪽","할머니","할아버지","할인","함께","함부로","합격","합리적","항공","항구","항상","항의","해결","해군","해답","해당","해물","해석","해설","해수욕장","해안","핵심","핸드백","햄버거","햇볕","햇살","행동","행복","행사","행운","행위","향기","향상","향수","허락","허용","헬기","현관","현금","현대","현상","현실","현장","현재","현지","혈액","협력","형부","형사","형수","형식","형제","형태","형편","혜택","호기심","호남","호랑이","호박","호텔","호흡","혹시","홀로","홈페이지","홍보","홍수","홍차","화면","화분","화살","화요일","화장","화학","확보","확인","확장","확정","환갑","환경","환영","환율","환자","활기","활동","활발히","활용","활짝","회견","회관","회복","회색","회원","회장","회전","횟수","횡단보도","효율적","후반","후춧가루","훈련","훨씬","휴식","휴일","흉내","흐름","흑백","흑인","흔적","흔히","흥미","흥분","희곡","희망","희생","흰색","힘껏"]',
      );
    },
    3761: function (a) {
      a.exports = JSON.parse(
        '["ábaco","abdomen","abeja","abierto","abogado","abono","aborto","abrazo","abrir","abuelo","abuso","acabar","academia","acceso","acción","aceite","acelga","acento","aceptar","ácido","aclarar","acné","acoger","acoso","activo","acto","actriz","actuar","acudir","acuerdo","acusar","adicto","admitir","adoptar","adorno","aduana","adulto","aéreo","afectar","afición","afinar","afirmar","ágil","agitar","agonía","agosto","agotar","agregar","agrio","agua","agudo","águila","aguja","ahogo","ahorro","aire","aislar","ajedrez","ajeno","ajuste","alacrán","alambre","alarma","alba","álbum","alcalde","aldea","alegre","alejar","alerta","aleta","alfiler","alga","algodón","aliado","aliento","alivio","alma","almeja","almíbar","altar","alteza","altivo","alto","altura","alumno","alzar","amable","amante","amapola","amargo","amasar","ámbar","ámbito","ameno","amigo","amistad","amor","amparo","amplio","ancho","anciano","ancla","andar","andén","anemia","ángulo","anillo","ánimo","anís","anotar","antena","antiguo","antojo","anual","anular","anuncio","añadir","añejo","año","apagar","aparato","apetito","apio","aplicar","apodo","aporte","apoyo","aprender","aprobar","apuesta","apuro","arado","araña","arar","árbitro","árbol","arbusto","archivo","arco","arder","ardilla","arduo","área","árido","aries","armonía","arnés","aroma","arpa","arpón","arreglo","arroz","arruga","arte","artista","asa","asado","asalto","ascenso","asegurar","aseo","asesor","asiento","asilo","asistir","asno","asombro","áspero","astilla","astro","astuto","asumir","asunto","atajo","ataque","atar","atento","ateo","ático","atleta","átomo","atraer","atroz","atún","audaz","audio","auge","aula","aumento","ausente","autor","aval","avance","avaro","ave","avellana","avena","avestruz","avión","aviso","ayer","ayuda","ayuno","azafrán","azar","azote","azúcar","azufre","azul","baba","babor","bache","bahía","baile","bajar","balanza","balcón","balde","bambú","banco","banda","baño","barba","barco","barniz","barro","báscula","bastón","basura","batalla","batería","batir","batuta","baúl","bazar","bebé","bebida","bello","besar","beso","bestia","bicho","bien","bingo","blanco","bloque","blusa","boa","bobina","bobo","boca","bocina","boda","bodega","boina","bola","bolero","bolsa","bomba","bondad","bonito","bono","bonsái","borde","borrar","bosque","bote","botín","bóveda","bozal","bravo","brazo","brecha","breve","brillo","brinco","brisa","broca","broma","bronce","brote","bruja","brusco","bruto","buceo","bucle","bueno","buey","bufanda","bufón","búho","buitre","bulto","burbuja","burla","burro","buscar","butaca","buzón","caballo","cabeza","cabina","cabra","cacao","cadáver","cadena","caer","café","caída","caimán","caja","cajón","cal","calamar","calcio","caldo","calidad","calle","calma","calor","calvo","cama","cambio","camello","camino","campo","cáncer","candil","canela","canguro","canica","canto","caña","cañón","caoba","caos","capaz","capitán","capote","captar","capucha","cara","carbón","cárcel","careta","carga","cariño","carne","carpeta","carro","carta","casa","casco","casero","caspa","castor","catorce","catre","caudal","causa","cazo","cebolla","ceder","cedro","celda","célebre","celoso","célula","cemento","ceniza","centro","cerca","cerdo","cereza","cero","cerrar","certeza","césped","cetro","chacal","chaleco","champú","chancla","chapa","charla","chico","chiste","chivo","choque","choza","chuleta","chupar","ciclón","ciego","cielo","cien","cierto","cifra","cigarro","cima","cinco","cine","cinta","ciprés","circo","ciruela","cisne","cita","ciudad","clamor","clan","claro","clase","clave","cliente","clima","clínica","cobre","cocción","cochino","cocina","coco","código","codo","cofre","coger","cohete","cojín","cojo","cola","colcha","colegio","colgar","colina","collar","colmo","columna","combate","comer","comida","cómodo","compra","conde","conejo","conga","conocer","consejo","contar","copa","copia","corazón","corbata","corcho","cordón","corona","correr","coser","cosmos","costa","cráneo","cráter","crear","crecer","creído","crema","cría","crimen","cripta","crisis","cromo","crónica","croqueta","crudo","cruz","cuadro","cuarto","cuatro","cubo","cubrir","cuchara","cuello","cuento","cuerda","cuesta","cueva","cuidar","culebra","culpa","culto","cumbre","cumplir","cuna","cuneta","cuota","cupón","cúpula","curar","curioso","curso","curva","cutis","dama","danza","dar","dardo","dátil","deber","débil","década","decir","dedo","defensa","definir","dejar","delfín","delgado","delito","demora","denso","dental","deporte","derecho","derrota","desayuno","deseo","desfile","desnudo","destino","desvío","detalle","detener","deuda","día","diablo","diadema","diamante","diana","diario","dibujo","dictar","diente","dieta","diez","difícil","digno","dilema","diluir","dinero","directo","dirigir","disco","diseño","disfraz","diva","divino","doble","doce","dolor","domingo","don","donar","dorado","dormir","dorso","dos","dosis","dragón","droga","ducha","duda","duelo","dueño","dulce","dúo","duque","durar","dureza","duro","ébano","ebrio","echar","eco","ecuador","edad","edición","edificio","editor","educar","efecto","eficaz","eje","ejemplo","elefante","elegir","elemento","elevar","elipse","élite","elixir","elogio","eludir","embudo","emitir","emoción","empate","empeño","empleo","empresa","enano","encargo","enchufe","encía","enemigo","enero","enfado","enfermo","engaño","enigma","enlace","enorme","enredo","ensayo","enseñar","entero","entrar","envase","envío","época","equipo","erizo","escala","escena","escolar","escribir","escudo","esencia","esfera","esfuerzo","espada","espejo","espía","esposa","espuma","esquí","estar","este","estilo","estufa","etapa","eterno","ética","etnia","evadir","evaluar","evento","evitar","exacto","examen","exceso","excusa","exento","exigir","exilio","existir","éxito","experto","explicar","exponer","extremo","fábrica","fábula","fachada","fácil","factor","faena","faja","falda","fallo","falso","faltar","fama","familia","famoso","faraón","farmacia","farol","farsa","fase","fatiga","fauna","favor","fax","febrero","fecha","feliz","feo","feria","feroz","fértil","fervor","festín","fiable","fianza","fiar","fibra","ficción","ficha","fideo","fiebre","fiel","fiera","fiesta","figura","fijar","fijo","fila","filete","filial","filtro","fin","finca","fingir","finito","firma","flaco","flauta","flecha","flor","flota","fluir","flujo","flúor","fobia","foca","fogata","fogón","folio","folleto","fondo","forma","forro","fortuna","forzar","fosa","foto","fracaso","frágil","franja","frase","fraude","freír","freno","fresa","frío","frito","fruta","fuego","fuente","fuerza","fuga","fumar","función","funda","furgón","furia","fusil","fútbol","futuro","gacela","gafas","gaita","gajo","gala","galería","gallo","gamba","ganar","gancho","ganga","ganso","garaje","garza","gasolina","gastar","gato","gavilán","gemelo","gemir","gen","género","genio","gente","geranio","gerente","germen","gesto","gigante","gimnasio","girar","giro","glaciar","globo","gloria","gol","golfo","goloso","golpe","goma","gordo","gorila","gorra","gota","goteo","gozar","grada","gráfico","grano","grasa","gratis","grave","grieta","grillo","gripe","gris","grito","grosor","grúa","grueso","grumo","grupo","guante","guapo","guardia","guerra","guía","guiño","guion","guiso","guitarra","gusano","gustar","haber","hábil","hablar","hacer","hacha","hada","hallar","hamaca","harina","haz","hazaña","hebilla","hebra","hecho","helado","helio","hembra","herir","hermano","héroe","hervir","hielo","hierro","hígado","higiene","hijo","himno","historia","hocico","hogar","hoguera","hoja","hombre","hongo","honor","honra","hora","hormiga","horno","hostil","hoyo","hueco","huelga","huerta","hueso","huevo","huida","huir","humano","húmedo","humilde","humo","hundir","huracán","hurto","icono","ideal","idioma","ídolo","iglesia","iglú","igual","ilegal","ilusión","imagen","imán","imitar","impar","imperio","imponer","impulso","incapaz","índice","inerte","infiel","informe","ingenio","inicio","inmenso","inmune","innato","insecto","instante","interés","íntimo","intuir","inútil","invierno","ira","iris","ironía","isla","islote","jabalí","jabón","jamón","jarabe","jardín","jarra","jaula","jazmín","jefe","jeringa","jinete","jornada","joroba","joven","joya","juerga","jueves","juez","jugador","jugo","juguete","juicio","junco","jungla","junio","juntar","júpiter","jurar","justo","juvenil","juzgar","kilo","koala","labio","lacio","lacra","lado","ladrón","lagarto","lágrima","laguna","laico","lamer","lámina","lámpara","lana","lancha","langosta","lanza","lápiz","largo","larva","lástima","lata","látex","latir","laurel","lavar","lazo","leal","lección","leche","lector","leer","legión","legumbre","lejano","lengua","lento","leña","león","leopardo","lesión","letal","letra","leve","leyenda","libertad","libro","licor","líder","lidiar","lienzo","liga","ligero","lima","límite","limón","limpio","lince","lindo","línea","lingote","lino","linterna","líquido","liso","lista","litera","litio","litro","llaga","llama","llanto","llave","llegar","llenar","llevar","llorar","llover","lluvia","lobo","loción","loco","locura","lógica","logro","lombriz","lomo","lonja","lote","lucha","lucir","lugar","lujo","luna","lunes","lupa","lustro","luto","luz","maceta","macho","madera","madre","maduro","maestro","mafia","magia","mago","maíz","maldad","maleta","malla","malo","mamá","mambo","mamut","manco","mando","manejar","manga","maniquí","manjar","mano","manso","manta","mañana","mapa","máquina","mar","marco","marea","marfil","margen","marido","mármol","marrón","martes","marzo","masa","máscara","masivo","matar","materia","matiz","matriz","máximo","mayor","mazorca","mecha","medalla","medio","médula","mejilla","mejor","melena","melón","memoria","menor","mensaje","mente","menú","mercado","merengue","mérito","mes","mesón","meta","meter","método","metro","mezcla","miedo","miel","miembro","miga","mil","milagro","militar","millón","mimo","mina","minero","mínimo","minuto","miope","mirar","misa","miseria","misil","mismo","mitad","mito","mochila","moción","moda","modelo","moho","mojar","molde","moler","molino","momento","momia","monarca","moneda","monja","monto","moño","morada","morder","moreno","morir","morro","morsa","mortal","mosca","mostrar","motivo","mover","móvil","mozo","mucho","mudar","mueble","muela","muerte","muestra","mugre","mujer","mula","muleta","multa","mundo","muñeca","mural","muro","músculo","museo","musgo","música","muslo","nácar","nación","nadar","naipe","naranja","nariz","narrar","nasal","natal","nativo","natural","náusea","naval","nave","navidad","necio","néctar","negar","negocio","negro","neón","nervio","neto","neutro","nevar","nevera","nicho","nido","niebla","nieto","niñez","niño","nítido","nivel","nobleza","noche","nómina","noria","norma","norte","nota","noticia","novato","novela","novio","nube","nuca","núcleo","nudillo","nudo","nuera","nueve","nuez","nulo","número","nutria","oasis","obeso","obispo","objeto","obra","obrero","observar","obtener","obvio","oca","ocaso","océano","ochenta","ocho","ocio","ocre","octavo","octubre","oculto","ocupar","ocurrir","odiar","odio","odisea","oeste","ofensa","oferta","oficio","ofrecer","ogro","oído","oír","ojo","ola","oleada","olfato","olivo","olla","olmo","olor","olvido","ombligo","onda","onza","opaco","opción","ópera","opinar","oponer","optar","óptica","opuesto","oración","orador","oral","órbita","orca","orden","oreja","órgano","orgía","orgullo","oriente","origen","orilla","oro","orquesta","oruga","osadía","oscuro","osezno","oso","ostra","otoño","otro","oveja","óvulo","óxido","oxígeno","oyente","ozono","pacto","padre","paella","página","pago","país","pájaro","palabra","palco","paleta","pálido","palma","paloma","palpar","pan","panal","pánico","pantera","pañuelo","papá","papel","papilla","paquete","parar","parcela","pared","parir","paro","párpado","parque","párrafo","parte","pasar","paseo","pasión","paso","pasta","pata","patio","patria","pausa","pauta","pavo","payaso","peatón","pecado","pecera","pecho","pedal","pedir","pegar","peine","pelar","peldaño","pelea","peligro","pellejo","pelo","peluca","pena","pensar","peñón","peón","peor","pepino","pequeño","pera","percha","perder","pereza","perfil","perico","perla","permiso","perro","persona","pesa","pesca","pésimo","pestaña","pétalo","petróleo","pez","pezuña","picar","pichón","pie","piedra","pierna","pieza","pijama","pilar","piloto","pimienta","pino","pintor","pinza","piña","piojo","pipa","pirata","pisar","piscina","piso","pista","pitón","pizca","placa","plan","plata","playa","plaza","pleito","pleno","plomo","pluma","plural","pobre","poco","poder","podio","poema","poesía","poeta","polen","policía","pollo","polvo","pomada","pomelo","pomo","pompa","poner","porción","portal","posada","poseer","posible","poste","potencia","potro","pozo","prado","precoz","pregunta","premio","prensa","preso","previo","primo","príncipe","prisión","privar","proa","probar","proceso","producto","proeza","profesor","programa","prole","promesa","pronto","propio","próximo","prueba","público","puchero","pudor","pueblo","puerta","puesto","pulga","pulir","pulmón","pulpo","pulso","puma","punto","puñal","puño","pupa","pupila","puré","quedar","queja","quemar","querer","queso","quieto","química","quince","quitar","rábano","rabia","rabo","ración","radical","raíz","rama","rampa","rancho","rango","rapaz","rápido","rapto","rasgo","raspa","rato","rayo","raza","razón","reacción","realidad","rebaño","rebote","recaer","receta","rechazo","recoger","recreo","recto","recurso","red","redondo","reducir","reflejo","reforma","refrán","refugio","regalo","regir","regla","regreso","rehén","reino","reír","reja","relato","relevo","relieve","relleno","reloj","remar","remedio","remo","rencor","rendir","renta","reparto","repetir","reposo","reptil","res","rescate","resina","respeto","resto","resumen","retiro","retorno","retrato","reunir","revés","revista","rey","rezar","rico","riego","rienda","riesgo","rifa","rígido","rigor","rincón","riñón","río","riqueza","risa","ritmo","rito","rizo","roble","roce","rociar","rodar","rodeo","rodilla","roer","rojizo","rojo","romero","romper","ron","ronco","ronda","ropa","ropero","rosa","rosca","rostro","rotar","rubí","rubor","rudo","rueda","rugir","ruido","ruina","ruleta","rulo","rumbo","rumor","ruptura","ruta","rutina","sábado","saber","sabio","sable","sacar","sagaz","sagrado","sala","saldo","salero","salir","salmón","salón","salsa","salto","salud","salvar","samba","sanción","sandía","sanear","sangre","sanidad","sano","santo","sapo","saque","sardina","sartén","sastre","satán","sauna","saxofón","sección","seco","secreto","secta","sed","seguir","seis","sello","selva","semana","semilla","senda","sensor","señal","señor","separar","sepia","sequía","ser","serie","sermón","servir","sesenta","sesión","seta","setenta","severo","sexo","sexto","sidra","siesta","siete","siglo","signo","sílaba","silbar","silencio","silla","símbolo","simio","sirena","sistema","sitio","situar","sobre","socio","sodio","sol","solapa","soldado","soledad","sólido","soltar","solución","sombra","sondeo","sonido","sonoro","sonrisa","sopa","soplar","soporte","sordo","sorpresa","sorteo","sostén","sótano","suave","subir","suceso","sudor","suegra","suelo","sueño","suerte","sufrir","sujeto","sultán","sumar","superar","suplir","suponer","supremo","sur","surco","sureño","surgir","susto","sutil","tabaco","tabique","tabla","tabú","taco","tacto","tajo","talar","talco","talento","talla","talón","tamaño","tambor","tango","tanque","tapa","tapete","tapia","tapón","taquilla","tarde","tarea","tarifa","tarjeta","tarot","tarro","tarta","tatuaje","tauro","taza","tazón","teatro","techo","tecla","técnica","tejado","tejer","tejido","tela","teléfono","tema","temor","templo","tenaz","tender","tener","tenis","tenso","teoría","terapia","terco","término","ternura","terror","tesis","tesoro","testigo","tetera","texto","tez","tibio","tiburón","tiempo","tienda","tierra","tieso","tigre","tijera","tilde","timbre","tímido","timo","tinta","tío","típico","tipo","tira","tirón","titán","títere","título","tiza","toalla","tobillo","tocar","tocino","todo","toga","toldo","tomar","tono","tonto","topar","tope","toque","tórax","torero","tormenta","torneo","toro","torpedo","torre","torso","tortuga","tos","tosco","toser","tóxico","trabajo","tractor","traer","tráfico","trago","traje","tramo","trance","trato","trauma","trazar","trébol","tregua","treinta","tren","trepar","tres","tribu","trigo","tripa","triste","triunfo","trofeo","trompa","tronco","tropa","trote","trozo","truco","trueno","trufa","tubería","tubo","tuerto","tumba","tumor","túnel","túnica","turbina","turismo","turno","tutor","ubicar","úlcera","umbral","unidad","unir","universo","uno","untar","uña","urbano","urbe","urgente","urna","usar","usuario","útil","utopía","uva","vaca","vacío","vacuna","vagar","vago","vaina","vajilla","vale","válido","valle","valor","válvula","vampiro","vara","variar","varón","vaso","vecino","vector","vehículo","veinte","vejez","vela","velero","veloz","vena","vencer","venda","veneno","vengar","venir","venta","venus","ver","verano","verbo","verde","vereda","verja","verso","verter","vía","viaje","vibrar","vicio","víctima","vida","vídeo","vidrio","viejo","viernes","vigor","vil","villa","vinagre","vino","viñedo","violín","viral","virgo","virtud","visor","víspera","vista","vitamina","viudo","vivaz","vivero","vivir","vivo","volcán","volumen","volver","voraz","votar","voto","voz","vuelo","vulgar","yacer","yate","yegua","yema","yerno","yeso","yodo","yoga","yogur","zafiro","zanja","zapato","zarza","zona","zorro","zumo","zurdo"]',
      );
    },
    3762: function (a) {
      a.exports = JSON.parse(
        '["あいこくしん","あいさつ","あいだ","あおぞら","あかちゃん","あきる","あけがた","あける","あこがれる","あさい","あさひ","あしあと","あじわう","あずかる","あずき","あそぶ","あたえる","あたためる","あたりまえ","あたる","あつい","あつかう","あっしゅく","あつまり","あつめる","あてな","あてはまる","あひる","あぶら","あぶる","あふれる","あまい","あまど","あまやかす","あまり","あみもの","あめりか","あやまる","あゆむ","あらいぐま","あらし","あらすじ","あらためる","あらゆる","あらわす","ありがとう","あわせる","あわてる","あんい","あんがい","あんこ","あんぜん","あんてい","あんない","あんまり","いいだす","いおん","いがい","いがく","いきおい","いきなり","いきもの","いきる","いくじ","いくぶん","いけばな","いけん","いこう","いこく","いこつ","いさましい","いさん","いしき","いじゅう","いじょう","いじわる","いずみ","いずれ","いせい","いせえび","いせかい","いせき","いぜん","いそうろう","いそがしい","いだい","いだく","いたずら","いたみ","いたりあ","いちおう","いちじ","いちど","いちば","いちぶ","いちりゅう","いつか","いっしゅん","いっせい","いっそう","いったん","いっち","いってい","いっぽう","いてざ","いてん","いどう","いとこ","いない","いなか","いねむり","いのち","いのる","いはつ","いばる","いはん","いびき","いひん","いふく","いへん","いほう","いみん","いもうと","いもたれ","いもり","いやがる","いやす","いよかん","いよく","いらい","いらすと","いりぐち","いりょう","いれい","いれもの","いれる","いろえんぴつ","いわい","いわう","いわかん","いわば","いわゆる","いんげんまめ","いんさつ","いんしょう","いんよう","うえき","うえる","うおざ","うがい","うかぶ","うかべる","うきわ","うくらいな","うくれれ","うけたまわる","うけつけ","うけとる","うけもつ","うける","うごかす","うごく","うこん","うさぎ","うしなう","うしろがみ","うすい","うすぎ","うすぐらい","うすめる","うせつ","うちあわせ","うちがわ","うちき","うちゅう","うっかり","うつくしい","うったえる","うつる","うどん","うなぎ","うなじ","うなずく","うなる","うねる","うのう","うぶげ","うぶごえ","うまれる","うめる","うもう","うやまう","うよく","うらがえす","うらぐち","うらない","うりあげ","うりきれ","うるさい","うれしい","うれゆき","うれる","うろこ","うわき","うわさ","うんこう","うんちん","うんてん","うんどう","えいえん","えいが","えいきょう","えいご","えいせい","えいぶん","えいよう","えいわ","えおり","えがお","えがく","えきたい","えくせる","えしゃく","えすて","えつらん","えのぐ","えほうまき","えほん","えまき","えもじ","えもの","えらい","えらぶ","えりあ","えんえん","えんかい","えんぎ","えんげき","えんしゅう","えんぜつ","えんそく","えんちょう","えんとつ","おいかける","おいこす","おいしい","おいつく","おうえん","おうさま","おうじ","おうせつ","おうたい","おうふく","おうべい","おうよう","おえる","おおい","おおう","おおどおり","おおや","おおよそ","おかえり","おかず","おがむ","おかわり","おぎなう","おきる","おくさま","おくじょう","おくりがな","おくる","おくれる","おこす","おこなう","おこる","おさえる","おさない","おさめる","おしいれ","おしえる","おじぎ","おじさん","おしゃれ","おそらく","おそわる","おたがい","おたく","おだやか","おちつく","おっと","おつり","おでかけ","おとしもの","おとなしい","おどり","おどろかす","おばさん","おまいり","おめでとう","おもいで","おもう","おもたい","おもちゃ","おやつ","おやゆび","およぼす","おらんだ","おろす","おんがく","おんけい","おんしゃ","おんせん","おんだん","おんちゅう","おんどけい","かあつ","かいが","がいき","がいけん","がいこう","かいさつ","かいしゃ","かいすいよく","かいぜん","かいぞうど","かいつう","かいてん","かいとう","かいふく","がいへき","かいほう","かいよう","がいらい","かいわ","かえる","かおり","かかえる","かがく","かがし","かがみ","かくご","かくとく","かざる","がぞう","かたい","かたち","がちょう","がっきゅう","がっこう","がっさん","がっしょう","かなざわし","かのう","がはく","かぶか","かほう","かほご","かまう","かまぼこ","かめれおん","かゆい","かようび","からい","かるい","かろう","かわく","かわら","がんか","かんけい","かんこう","かんしゃ","かんそう","かんたん","かんち","がんばる","きあい","きあつ","きいろ","ぎいん","きうい","きうん","きえる","きおう","きおく","きおち","きおん","きかい","きかく","きかんしゃ","ききて","きくばり","きくらげ","きけんせい","きこう","きこえる","きこく","きさい","きさく","きさま","きさらぎ","ぎじかがく","ぎしき","ぎじたいけん","ぎじにってい","ぎじゅつしゃ","きすう","きせい","きせき","きせつ","きそう","きぞく","きぞん","きたえる","きちょう","きつえん","ぎっちり","きつつき","きつね","きてい","きどう","きどく","きない","きなが","きなこ","きぬごし","きねん","きのう","きのした","きはく","きびしい","きひん","きふく","きぶん","きぼう","きほん","きまる","きみつ","きむずかしい","きめる","きもだめし","きもち","きもの","きゃく","きやく","ぎゅうにく","きよう","きょうりゅう","きらい","きらく","きりん","きれい","きれつ","きろく","ぎろん","きわめる","ぎんいろ","きんかくじ","きんじょ","きんようび","ぐあい","くいず","くうかん","くうき","くうぐん","くうこう","ぐうせい","くうそう","ぐうたら","くうふく","くうぼ","くかん","くきょう","くげん","ぐこう","くさい","くさき","くさばな","くさる","くしゃみ","くしょう","くすのき","くすりゆび","くせげ","くせん","ぐたいてき","くださる","くたびれる","くちこみ","くちさき","くつした","ぐっすり","くつろぐ","くとうてん","くどく","くなん","くねくね","くのう","くふう","くみあわせ","くみたてる","くめる","くやくしょ","くらす","くらべる","くるま","くれる","くろう","くわしい","ぐんかん","ぐんしょく","ぐんたい","ぐんて","けあな","けいかく","けいけん","けいこ","けいさつ","げいじゅつ","けいたい","げいのうじん","けいれき","けいろ","けおとす","けおりもの","げきか","げきげん","げきだん","げきちん","げきとつ","げきは","げきやく","げこう","げこくじょう","げざい","けさき","げざん","けしき","けしごむ","けしょう","げすと","けたば","けちゃっぷ","けちらす","けつあつ","けつい","けつえき","けっこん","けつじょ","けっせき","けってい","けつまつ","げつようび","げつれい","けつろん","げどく","けとばす","けとる","けなげ","けなす","けなみ","けぬき","げねつ","けねん","けはい","げひん","けぶかい","げぼく","けまり","けみかる","けむし","けむり","けもの","けらい","けろけろ","けわしい","けんい","けんえつ","けんお","けんか","げんき","けんげん","けんこう","けんさく","けんしゅう","けんすう","げんそう","けんちく","けんてい","けんとう","けんない","けんにん","げんぶつ","けんま","けんみん","けんめい","けんらん","けんり","こあくま","こいぬ","こいびと","ごうい","こうえん","こうおん","こうかん","ごうきゅう","ごうけい","こうこう","こうさい","こうじ","こうすい","ごうせい","こうそく","こうたい","こうちゃ","こうつう","こうてい","こうどう","こうない","こうはい","ごうほう","ごうまん","こうもく","こうりつ","こえる","こおり","ごかい","ごがつ","ごかん","こくご","こくさい","こくとう","こくない","こくはく","こぐま","こけい","こける","ここのか","こころ","こさめ","こしつ","こすう","こせい","こせき","こぜん","こそだて","こたい","こたえる","こたつ","こちょう","こっか","こつこつ","こつばん","こつぶ","こてい","こてん","ことがら","ことし","ことば","ことり","こなごな","こねこね","このまま","このみ","このよ","ごはん","こひつじ","こふう","こふん","こぼれる","ごまあぶら","こまかい","ごますり","こまつな","こまる","こむぎこ","こもじ","こもち","こもの","こもん","こやく","こやま","こゆう","こゆび","こよい","こよう","こりる","これくしょん","ころっけ","こわもて","こわれる","こんいん","こんかい","こんき","こんしゅう","こんすい","こんだて","こんとん","こんなん","こんびに","こんぽん","こんまけ","こんや","こんれい","こんわく","ざいえき","さいかい","さいきん","ざいげん","ざいこ","さいしょ","さいせい","ざいたく","ざいちゅう","さいてき","ざいりょう","さうな","さかいし","さがす","さかな","さかみち","さがる","さぎょう","さくし","さくひん","さくら","さこく","さこつ","さずかる","ざせき","さたん","さつえい","ざつおん","ざっか","ざつがく","さっきょく","ざっし","さつじん","ざっそう","さつたば","さつまいも","さてい","さといも","さとう","さとおや","さとし","さとる","さのう","さばく","さびしい","さべつ","さほう","さほど","さます","さみしい","さみだれ","さむけ","さめる","さやえんどう","さゆう","さよう","さよく","さらだ","ざるそば","さわやか","さわる","さんいん","さんか","さんきゃく","さんこう","さんさい","ざんしょ","さんすう","さんせい","さんそ","さんち","さんま","さんみ","さんらん","しあい","しあげ","しあさって","しあわせ","しいく","しいん","しうち","しえい","しおけ","しかい","しかく","じかん","しごと","しすう","じだい","したうけ","したぎ","したて","したみ","しちょう","しちりん","しっかり","しつじ","しつもん","してい","してき","してつ","じてん","じどう","しなぎれ","しなもの","しなん","しねま","しねん","しのぐ","しのぶ","しはい","しばかり","しはつ","しはらい","しはん","しひょう","しふく","じぶん","しへい","しほう","しほん","しまう","しまる","しみん","しむける","じむしょ","しめい","しめる","しもん","しゃいん","しゃうん","しゃおん","じゃがいも","しやくしょ","しゃくほう","しゃけん","しゃこ","しゃざい","しゃしん","しゃせん","しゃそう","しゃたい","しゃちょう","しゃっきん","じゃま","しゃりん","しゃれい","じゆう","じゅうしょ","しゅくはく","じゅしん","しゅっせき","しゅみ","しゅらば","じゅんばん","しょうかい","しょくたく","しょっけん","しょどう","しょもつ","しらせる","しらべる","しんか","しんこう","じんじゃ","しんせいじ","しんちく","しんりん","すあげ","すあし","すあな","ずあん","すいえい","すいか","すいとう","ずいぶん","すいようび","すうがく","すうじつ","すうせん","すおどり","すきま","すくう","すくない","すける","すごい","すこし","ずさん","すずしい","すすむ","すすめる","すっかり","ずっしり","ずっと","すてき","すてる","すねる","すのこ","すはだ","すばらしい","ずひょう","ずぶぬれ","すぶり","すふれ","すべて","すべる","ずほう","すぼん","すまい","すめし","すもう","すやき","すらすら","するめ","すれちがう","すろっと","すわる","すんぜん","すんぽう","せあぶら","せいかつ","せいげん","せいじ","せいよう","せおう","せかいかん","せきにん","せきむ","せきゆ","せきらんうん","せけん","せこう","せすじ","せたい","せたけ","せっかく","せっきゃく","ぜっく","せっけん","せっこつ","せっさたくま","せつぞく","せつだん","せつでん","せっぱん","せつび","せつぶん","せつめい","せつりつ","せなか","せのび","せはば","せびろ","せぼね","せまい","せまる","せめる","せもたれ","せりふ","ぜんあく","せんい","せんえい","せんか","せんきょ","せんく","せんげん","ぜんご","せんさい","せんしゅ","せんすい","せんせい","せんぞ","せんたく","せんちょう","せんてい","せんとう","せんぬき","せんねん","せんぱい","ぜんぶ","ぜんぽう","せんむ","せんめんじょ","せんもん","せんやく","せんゆう","せんよう","ぜんら","ぜんりゃく","せんれい","せんろ","そあく","そいとげる","そいね","そうがんきょう","そうき","そうご","そうしん","そうだん","そうなん","そうび","そうめん","そうり","そえもの","そえん","そがい","そげき","そこう","そこそこ","そざい","そしな","そせい","そせん","そそぐ","そだてる","そつう","そつえん","そっかん","そつぎょう","そっけつ","そっこう","そっせん","そっと","そとがわ","そとづら","そなえる","そなた","そふぼ","そぼく","そぼろ","そまつ","そまる","そむく","そむりえ","そめる","そもそも","そよかぜ","そらまめ","そろう","そんかい","そんけい","そんざい","そんしつ","そんぞく","そんちょう","ぞんび","ぞんぶん","そんみん","たあい","たいいん","たいうん","たいえき","たいおう","だいがく","たいき","たいぐう","たいけん","たいこ","たいざい","だいじょうぶ","だいすき","たいせつ","たいそう","だいたい","たいちょう","たいてい","だいどころ","たいない","たいねつ","たいのう","たいはん","だいひょう","たいふう","たいへん","たいほ","たいまつばな","たいみんぐ","たいむ","たいめん","たいやき","たいよう","たいら","たいりょく","たいる","たいわん","たうえ","たえる","たおす","たおる","たおれる","たかい","たかね","たきび","たくさん","たこく","たこやき","たさい","たしざん","だじゃれ","たすける","たずさわる","たそがれ","たたかう","たたく","ただしい","たたみ","たちばな","だっかい","だっきゃく","だっこ","だっしゅつ","だったい","たてる","たとえる","たなばた","たにん","たぬき","たのしみ","たはつ","たぶん","たべる","たぼう","たまご","たまる","だむる","ためいき","ためす","ためる","たもつ","たやすい","たよる","たらす","たりきほんがん","たりょう","たりる","たると","たれる","たれんと","たろっと","たわむれる","だんあつ","たんい","たんおん","たんか","たんき","たんけん","たんご","たんさん","たんじょうび","だんせい","たんそく","たんたい","だんち","たんてい","たんとう","だんな","たんにん","だんねつ","たんのう","たんぴん","だんぼう","たんまつ","たんめい","だんれつ","だんろ","だんわ","ちあい","ちあん","ちいき","ちいさい","ちえん","ちかい","ちから","ちきゅう","ちきん","ちけいず","ちけん","ちこく","ちさい","ちしき","ちしりょう","ちせい","ちそう","ちたい","ちたん","ちちおや","ちつじょ","ちてき","ちてん","ちぬき","ちぬり","ちのう","ちひょう","ちへいせん","ちほう","ちまた","ちみつ","ちみどろ","ちめいど","ちゃんこなべ","ちゅうい","ちゆりょく","ちょうし","ちょさくけん","ちらし","ちらみ","ちりがみ","ちりょう","ちるど","ちわわ","ちんたい","ちんもく","ついか","ついたち","つうか","つうじょう","つうはん","つうわ","つかう","つかれる","つくね","つくる","つけね","つける","つごう","つたえる","つづく","つつじ","つつむ","つとめる","つながる","つなみ","つねづね","つのる","つぶす","つまらない","つまる","つみき","つめたい","つもり","つもる","つよい","つるぼ","つるみく","つわもの","つわり","てあし","てあて","てあみ","ていおん","ていか","ていき","ていけい","ていこく","ていさつ","ていし","ていせい","ていたい","ていど","ていねい","ていひょう","ていへん","ていぼう","てうち","ておくれ","てきとう","てくび","でこぼこ","てさぎょう","てさげ","てすり","てそう","てちがい","てちょう","てつがく","てつづき","でっぱ","てつぼう","てつや","でぬかえ","てぬき","てぬぐい","てのひら","てはい","てぶくろ","てふだ","てほどき","てほん","てまえ","てまきずし","てみじか","てみやげ","てらす","てれび","てわけ","てわたし","でんあつ","てんいん","てんかい","てんき","てんぐ","てんけん","てんごく","てんさい","てんし","てんすう","でんち","てんてき","てんとう","てんない","てんぷら","てんぼうだい","てんめつ","てんらんかい","でんりょく","でんわ","どあい","といれ","どうかん","とうきゅう","どうぐ","とうし","とうむぎ","とおい","とおか","とおく","とおす","とおる","とかい","とかす","ときおり","ときどき","とくい","とくしゅう","とくてん","とくに","とくべつ","とけい","とける","とこや","とさか","としょかん","とそう","とたん","とちゅう","とっきゅう","とっくん","とつぜん","とつにゅう","とどける","ととのえる","とない","となえる","となり","とのさま","とばす","どぶがわ","とほう","とまる","とめる","ともだち","ともる","どようび","とらえる","とんかつ","どんぶり","ないかく","ないこう","ないしょ","ないす","ないせん","ないそう","なおす","ながい","なくす","なげる","なこうど","なさけ","なたでここ","なっとう","なつやすみ","ななおし","なにごと","なにもの","なにわ","なのか","なふだ","なまいき","なまえ","なまみ","なみだ","なめらか","なめる","なやむ","ならう","ならび","ならぶ","なれる","なわとび","なわばり","にあう","にいがた","にうけ","におい","にかい","にがて","にきび","にくしみ","にくまん","にげる","にさんかたんそ","にしき","にせもの","にちじょう","にちようび","にっか","にっき","にっけい","にっこう","にっさん","にっしょく","にっすう","にっせき","にってい","になう","にほん","にまめ","にもつ","にやり","にゅういん","にりんしゃ","にわとり","にんい","にんか","にんき","にんげん","にんしき","にんずう","にんそう","にんたい","にんち","にんてい","にんにく","にんぷ","にんまり","にんむ","にんめい","にんよう","ぬいくぎ","ぬかす","ぬぐいとる","ぬぐう","ぬくもり","ぬすむ","ぬまえび","ぬめり","ぬらす","ぬんちゃく","ねあげ","ねいき","ねいる","ねいろ","ねぐせ","ねくたい","ねくら","ねこぜ","ねこむ","ねさげ","ねすごす","ねそべる","ねだん","ねつい","ねっしん","ねつぞう","ねったいぎょ","ねぶそく","ねふだ","ねぼう","ねほりはほり","ねまき","ねまわし","ねみみ","ねむい","ねむたい","ねもと","ねらう","ねわざ","ねんいり","ねんおし","ねんかん","ねんきん","ねんぐ","ねんざ","ねんし","ねんちゃく","ねんど","ねんぴ","ねんぶつ","ねんまつ","ねんりょう","ねんれい","のいず","のおづま","のがす","のきなみ","のこぎり","のこす","のこる","のせる","のぞく","のぞむ","のたまう","のちほど","のっく","のばす","のはら","のべる","のぼる","のみもの","のやま","のらいぬ","のらねこ","のりもの","のりゆき","のれん","のんき","ばあい","はあく","ばあさん","ばいか","ばいく","はいけん","はいご","はいしん","はいすい","はいせん","はいそう","はいち","ばいばい","はいれつ","はえる","はおる","はかい","ばかり","はかる","はくしゅ","はけん","はこぶ","はさみ","はさん","はしご","ばしょ","はしる","はせる","ぱそこん","はそん","はたん","はちみつ","はつおん","はっかく","はづき","はっきり","はっくつ","はっけん","はっこう","はっさん","はっしん","はったつ","はっちゅう","はってん","はっぴょう","はっぽう","はなす","はなび","はにかむ","はぶらし","はみがき","はむかう","はめつ","はやい","はやし","はらう","はろうぃん","はわい","はんい","はんえい","はんおん","はんかく","はんきょう","ばんぐみ","はんこ","はんしゃ","はんすう","はんだん","ぱんち","ぱんつ","はんてい","はんとし","はんのう","はんぱ","はんぶん","はんぺん","はんぼうき","はんめい","はんらん","はんろん","ひいき","ひうん","ひえる","ひかく","ひかり","ひかる","ひかん","ひくい","ひけつ","ひこうき","ひこく","ひさい","ひさしぶり","ひさん","びじゅつかん","ひしょ","ひそか","ひそむ","ひたむき","ひだり","ひたる","ひつぎ","ひっこし","ひっし","ひつじゅひん","ひっす","ひつぜん","ぴったり","ぴっちり","ひつよう","ひてい","ひとごみ","ひなまつり","ひなん","ひねる","ひはん","ひびく","ひひょう","ひほう","ひまわり","ひまん","ひみつ","ひめい","ひめじし","ひやけ","ひやす","ひよう","びょうき","ひらがな","ひらく","ひりつ","ひりょう","ひるま","ひるやすみ","ひれい","ひろい","ひろう","ひろき","ひろゆき","ひんかく","ひんけつ","ひんこん","ひんしゅ","ひんそう","ぴんち","ひんぱん","びんぼう","ふあん","ふいうち","ふうけい","ふうせん","ぷうたろう","ふうとう","ふうふ","ふえる","ふおん","ふかい","ふきん","ふくざつ","ふくぶくろ","ふこう","ふさい","ふしぎ","ふじみ","ふすま","ふせい","ふせぐ","ふそく","ぶたにく","ふたん","ふちょう","ふつう","ふつか","ふっかつ","ふっき","ふっこく","ぶどう","ふとる","ふとん","ふのう","ふはい","ふひょう","ふへん","ふまん","ふみん","ふめつ","ふめん","ふよう","ふりこ","ふりる","ふるい","ふんいき","ぶんがく","ぶんぐ","ふんしつ","ぶんせき","ふんそう","ぶんぽう","へいあん","へいおん","へいがい","へいき","へいげん","へいこう","へいさ","へいしゃ","へいせつ","へいそ","へいたく","へいてん","へいねつ","へいわ","へきが","へこむ","べにいろ","べにしょうが","へらす","へんかん","べんきょう","べんごし","へんさい","へんたい","べんり","ほあん","ほいく","ぼうぎょ","ほうこく","ほうそう","ほうほう","ほうもん","ほうりつ","ほえる","ほおん","ほかん","ほきょう","ぼきん","ほくろ","ほけつ","ほけん","ほこう","ほこる","ほしい","ほしつ","ほしゅ","ほしょう","ほせい","ほそい","ほそく","ほたて","ほたる","ぽちぶくろ","ほっきょく","ほっさ","ほったん","ほとんど","ほめる","ほんい","ほんき","ほんけ","ほんしつ","ほんやく","まいにち","まかい","まかせる","まがる","まける","まこと","まさつ","まじめ","ますく","まぜる","まつり","まとめ","まなぶ","まぬけ","まねく","まほう","まもる","まゆげ","まよう","まろやか","まわす","まわり","まわる","まんが","まんきつ","まんぞく","まんなか","みいら","みうち","みえる","みがく","みかた","みかん","みけん","みこん","みじかい","みすい","みすえる","みせる","みっか","みつかる","みつける","みてい","みとめる","みなと","みなみかさい","みねらる","みのう","みのがす","みほん","みもと","みやげ","みらい","みりょく","みわく","みんか","みんぞく","むいか","むえき","むえん","むかい","むかう","むかえ","むかし","むぎちゃ","むける","むげん","むさぼる","むしあつい","むしば","むじゅん","むしろ","むすう","むすこ","むすぶ","むすめ","むせる","むせん","むちゅう","むなしい","むのう","むやみ","むよう","むらさき","むりょう","むろん","めいあん","めいうん","めいえん","めいかく","めいきょく","めいさい","めいし","めいそう","めいぶつ","めいれい","めいわく","めぐまれる","めざす","めした","めずらしい","めだつ","めまい","めやす","めんきょ","めんせき","めんどう","もうしあげる","もうどうけん","もえる","もくし","もくてき","もくようび","もちろん","もどる","もらう","もんく","もんだい","やおや","やける","やさい","やさしい","やすい","やすたろう","やすみ","やせる","やそう","やたい","やちん","やっと","やっぱり","やぶる","やめる","ややこしい","やよい","やわらかい","ゆうき","ゆうびんきょく","ゆうべ","ゆうめい","ゆけつ","ゆしゅつ","ゆせん","ゆそう","ゆたか","ゆちゃく","ゆでる","ゆにゅう","ゆびわ","ゆらい","ゆれる","ようい","ようか","ようきゅう","ようじ","ようす","ようちえん","よかぜ","よかん","よきん","よくせい","よくぼう","よけい","よごれる","よさん","よしゅう","よそう","よそく","よっか","よてい","よどがわく","よねつ","よやく","よゆう","よろこぶ","よろしい","らいう","らくがき","らくご","らくさつ","らくだ","らしんばん","らせん","らぞく","らたい","らっか","られつ","りえき","りかい","りきさく","りきせつ","りくぐん","りくつ","りけん","りこう","りせい","りそう","りそく","りてん","りねん","りゆう","りゅうがく","りよう","りょうり","りょかん","りょくちゃ","りょこう","りりく","りれき","りろん","りんご","るいけい","るいさい","るいじ","るいせき","るすばん","るりがわら","れいかん","れいぎ","れいせい","れいぞうこ","れいとう","れいぼう","れきし","れきだい","れんあい","れんけい","れんこん","れんさい","れんしゅう","れんぞく","れんらく","ろうか","ろうご","ろうじん","ろうそく","ろくが","ろこつ","ろじうら","ろしゅつ","ろせん","ろてん","ろめん","ろれつ","ろんぎ","ろんぱ","ろんぶん","ろんり","わかす","わかめ","わかやま","わかれる","わしつ","わじまし","わすれもの","わらう","われる"]',
      );
    },
    3763: function (a) {
      a.exports = JSON.parse(
        '["abacate","abaixo","abalar","abater","abduzir","abelha","aberto","abismo","abotoar","abranger","abreviar","abrigar","abrupto","absinto","absoluto","absurdo","abutre","acabado","acalmar","acampar","acanhar","acaso","aceitar","acelerar","acenar","acervo","acessar","acetona","achatar","acidez","acima","acionado","acirrar","aclamar","aclive","acolhida","acomodar","acoplar","acordar","acumular","acusador","adaptar","adega","adentro","adepto","adequar","aderente","adesivo","adeus","adiante","aditivo","adjetivo","adjunto","admirar","adorar","adquirir","adubo","adverso","advogado","aeronave","afastar","aferir","afetivo","afinador","afivelar","aflito","afluente","afrontar","agachar","agarrar","agasalho","agenciar","agilizar","agiota","agitado","agora","agradar","agreste","agrupar","aguardar","agulha","ajoelhar","ajudar","ajustar","alameda","alarme","alastrar","alavanca","albergue","albino","alcatra","aldeia","alecrim","alegria","alertar","alface","alfinete","algum","alheio","aliar","alicate","alienar","alinhar","aliviar","almofada","alocar","alpiste","alterar","altitude","alucinar","alugar","aluno","alusivo","alvo","amaciar","amador","amarelo","amassar","ambas","ambiente","ameixa","amenizar","amido","amistoso","amizade","amolador","amontoar","amoroso","amostra","amparar","ampliar","ampola","anagrama","analisar","anarquia","anatomia","andaime","anel","anexo","angular","animar","anjo","anomalia","anotado","ansioso","anterior","anuidade","anunciar","anzol","apagador","apalpar","apanhado","apego","apelido","apertada","apesar","apetite","apito","aplauso","aplicada","apoio","apontar","aposta","aprendiz","aprovar","aquecer","arame","aranha","arara","arcada","ardente","areia","arejar","arenito","aresta","argiloso","argola","arma","arquivo","arraial","arrebate","arriscar","arroba","arrumar","arsenal","arterial","artigo","arvoredo","asfaltar","asilado","aspirar","assador","assinar","assoalho","assunto","astral","atacado","atadura","atalho","atarefar","atear","atender","aterro","ateu","atingir","atirador","ativo","atoleiro","atracar","atrevido","atriz","atual","atum","auditor","aumentar","aura","aurora","autismo","autoria","autuar","avaliar","avante","avaria","avental","avesso","aviador","avisar","avulso","axila","azarar","azedo","azeite","azulejo","babar","babosa","bacalhau","bacharel","bacia","bagagem","baiano","bailar","baioneta","bairro","baixista","bajular","baleia","baliza","balsa","banal","bandeira","banho","banir","banquete","barato","barbado","baronesa","barraca","barulho","baseado","bastante","batata","batedor","batida","batom","batucar","baunilha","beber","beijo","beirada","beisebol","beldade","beleza","belga","beliscar","bendito","bengala","benzer","berimbau","berlinda","berro","besouro","bexiga","bezerro","bico","bicudo","bienal","bifocal","bifurcar","bigorna","bilhete","bimestre","bimotor","biologia","biombo","biosfera","bipolar","birrento","biscoito","bisneto","bispo","bissexto","bitola","bizarro","blindado","bloco","bloquear","boato","bobagem","bocado","bocejo","bochecha","boicotar","bolada","boletim","bolha","bolo","bombeiro","bonde","boneco","bonita","borbulha","borda","boreal","borracha","bovino","boxeador","branco","brasa","braveza","breu","briga","brilho","brincar","broa","brochura","bronzear","broto","bruxo","bucha","budismo","bufar","bule","buraco","busca","busto","buzina","cabana","cabelo","cabide","cabo","cabrito","cacau","cacetada","cachorro","cacique","cadastro","cadeado","cafezal","caiaque","caipira","caixote","cajado","caju","calafrio","calcular","caldeira","calibrar","calmante","calota","camada","cambista","camisa","camomila","campanha","camuflar","canavial","cancelar","caneta","canguru","canhoto","canivete","canoa","cansado","cantar","canudo","capacho","capela","capinar","capotar","capricho","captador","capuz","caracol","carbono","cardeal","careca","carimbar","carneiro","carpete","carreira","cartaz","carvalho","casaco","casca","casebre","castelo","casulo","catarata","cativar","caule","causador","cautelar","cavalo","caverna","cebola","cedilha","cegonha","celebrar","celular","cenoura","censo","centeio","cercar","cerrado","certeiro","cerveja","cetim","cevada","chacota","chaleira","chamado","chapada","charme","chatice","chave","chefe","chegada","cheiro","cheque","chicote","chifre","chinelo","chocalho","chover","chumbo","chutar","chuva","cicatriz","ciclone","cidade","cidreira","ciente","cigana","cimento","cinto","cinza","ciranda","circuito","cirurgia","citar","clareza","clero","clicar","clone","clube","coado","coagir","cobaia","cobertor","cobrar","cocada","coelho","coentro","coeso","cogumelo","coibir","coifa","coiote","colar","coleira","colher","colidir","colmeia","colono","coluna","comando","combinar","comentar","comitiva","comover","complexo","comum","concha","condor","conectar","confuso","congelar","conhecer","conjugar","consumir","contrato","convite","cooperar","copeiro","copiador","copo","coquetel","coragem","cordial","corneta","coronha","corporal","correio","cortejo","coruja","corvo","cosseno","costela","cotonete","couro","couve","covil","cozinha","cratera","cravo","creche","credor","creme","crer","crespo","criada","criminal","crioulo","crise","criticar","crosta","crua","cruzeiro","cubano","cueca","cuidado","cujo","culatra","culminar","culpar","cultura","cumprir","cunhado","cupido","curativo","curral","cursar","curto","cuspir","custear","cutelo","damasco","datar","debater","debitar","deboche","debulhar","decalque","decimal","declive","decote","decretar","dedal","dedicado","deduzir","defesa","defumar","degelo","degrau","degustar","deitado","deixar","delator","delegado","delinear","delonga","demanda","demitir","demolido","dentista","depenado","depilar","depois","depressa","depurar","deriva","derramar","desafio","desbotar","descanso","desenho","desfiado","desgaste","desigual","deslize","desmamar","desova","despesa","destaque","desviar","detalhar","detentor","detonar","detrito","deusa","dever","devido","devotado","dezena","diagrama","dialeto","didata","difuso","digitar","dilatado","diluente","diminuir","dinastia","dinheiro","diocese","direto","discreta","disfarce","disparo","disquete","dissipar","distante","ditador","diurno","diverso","divisor","divulgar","dizer","dobrador","dolorido","domador","dominado","donativo","donzela","dormente","dorsal","dosagem","dourado","doutor","drenagem","drible","drogaria","duelar","duende","dueto","duplo","duquesa","durante","duvidoso","eclodir","ecoar","ecologia","edificar","edital","educado","efeito","efetivar","ejetar","elaborar","eleger","eleitor","elenco","elevador","eliminar","elogiar","embargo","embolado","embrulho","embutido","emenda","emergir","emissor","empatia","empenho","empinado","empolgar","emprego","empurrar","emulador","encaixe","encenado","enchente","encontro","endeusar","endossar","enfaixar","enfeite","enfim","engajado","engenho","englobar","engomado","engraxar","enguia","enjoar","enlatar","enquanto","enraizar","enrolado","enrugar","ensaio","enseada","ensino","ensopado","entanto","enteado","entidade","entortar","entrada","entulho","envergar","enviado","envolver","enxame","enxerto","enxofre","enxuto","epiderme","equipar","ereto","erguido","errata","erva","ervilha","esbanjar","esbelto","escama","escola","escrita","escuta","esfinge","esfolar","esfregar","esfumado","esgrima","esmalte","espanto","espelho","espiga","esponja","espreita","espumar","esquerda","estaca","esteira","esticar","estofado","estrela","estudo","esvaziar","etanol","etiqueta","euforia","europeu","evacuar","evaporar","evasivo","eventual","evidente","evoluir","exagero","exalar","examinar","exato","exausto","excesso","excitar","exclamar","executar","exemplo","exibir","exigente","exonerar","expandir","expelir","expirar","explanar","exposto","expresso","expulsar","externo","extinto","extrato","fabricar","fabuloso","faceta","facial","fada","fadiga","faixa","falar","falta","familiar","fandango","fanfarra","fantoche","fardado","farelo","farinha","farofa","farpa","fartura","fatia","fator","favorita","faxina","fazenda","fechado","feijoada","feirante","felino","feminino","fenda","feno","fera","feriado","ferrugem","ferver","festejar","fetal","feudal","fiapo","fibrose","ficar","ficheiro","figurado","fileira","filho","filme","filtrar","firmeza","fisgada","fissura","fita","fivela","fixador","fixo","flacidez","flamingo","flanela","flechada","flora","flutuar","fluxo","focal","focinho","fofocar","fogo","foguete","foice","folgado","folheto","forjar","formiga","forno","forte","fosco","fossa","fragata","fralda","frango","frasco","fraterno","freira","frente","fretar","frieza","friso","fritura","fronha","frustrar","fruteira","fugir","fulano","fuligem","fundar","fungo","funil","furador","furioso","futebol","gabarito","gabinete","gado","gaiato","gaiola","gaivota","galega","galho","galinha","galocha","ganhar","garagem","garfo","gargalo","garimpo","garoupa","garrafa","gasoduto","gasto","gata","gatilho","gaveta","gazela","gelado","geleia","gelo","gemada","gemer","gemido","generoso","gengiva","genial","genoma","genro","geologia","gerador","germinar","gesso","gestor","ginasta","gincana","gingado","girafa","girino","glacial","glicose","global","glorioso","goela","goiaba","golfe","golpear","gordura","gorjeta","gorro","gostoso","goteira","governar","gracejo","gradual","grafite","gralha","grampo","granada","gratuito","graveto","graxa","grego","grelhar","greve","grilo","grisalho","gritaria","grosso","grotesco","grudado","grunhido","gruta","guache","guarani","guaxinim","guerrear","guiar","guincho","guisado","gula","guloso","guru","habitar","harmonia","haste","haver","hectare","herdar","heresia","hesitar","hiato","hibernar","hidratar","hiena","hino","hipismo","hipnose","hipoteca","hoje","holofote","homem","honesto","honrado","hormonal","hospedar","humorado","iate","ideia","idoso","ignorado","igreja","iguana","ileso","ilha","iludido","iluminar","ilustrar","imagem","imediato","imenso","imersivo","iminente","imitador","imortal","impacto","impedir","implante","impor","imprensa","impune","imunizar","inalador","inapto","inativo","incenso","inchar","incidir","incluir","incolor","indeciso","indireto","indutor","ineficaz","inerente","infantil","infestar","infinito","inflamar","informal","infrator","ingerir","inibido","inicial","inimigo","injetar","inocente","inodoro","inovador","inox","inquieto","inscrito","inseto","insistir","inspetor","instalar","insulto","intacto","integral","intimar","intocado","intriga","invasor","inverno","invicto","invocar","iogurte","iraniano","ironizar","irreal","irritado","isca","isento","isolado","isqueiro","italiano","janeiro","jangada","janta","jararaca","jardim","jarro","jasmim","jato","javali","jazida","jejum","joaninha","joelhada","jogador","joia","jornal","jorrar","jovem","juba","judeu","judoca","juiz","julgador","julho","jurado","jurista","juro","justa","labareda","laboral","lacre","lactante","ladrilho","lagarta","lagoa","laje","lamber","lamentar","laminar","lampejo","lanche","lapidar","lapso","laranja","lareira","largura","lasanha","lastro","lateral","latido","lavanda","lavoura","lavrador","laxante","lazer","lealdade","lebre","legado","legendar","legista","leigo","leiloar","leitura","lembrete","leme","lenhador","lentilha","leoa","lesma","leste","letivo","letreiro","levar","leveza","levitar","liberal","libido","liderar","ligar","ligeiro","limitar","limoeiro","limpador","linda","linear","linhagem","liquidez","listagem","lisura","litoral","livro","lixa","lixeira","locador","locutor","lojista","lombo","lona","longe","lontra","lorde","lotado","loteria","loucura","lousa","louvar","luar","lucidez","lucro","luneta","lustre","lutador","luva","macaco","macete","machado","macio","madeira","madrinha","magnata","magreza","maior","mais","malandro","malha","malote","maluco","mamilo","mamoeiro","mamute","manada","mancha","mandato","manequim","manhoso","manivela","manobrar","mansa","manter","manusear","mapeado","maquinar","marcador","maresia","marfim","margem","marinho","marmita","maroto","marquise","marreco","martelo","marujo","mascote","masmorra","massagem","mastigar","matagal","materno","matinal","matutar","maxilar","medalha","medida","medusa","megafone","meiga","melancia","melhor","membro","memorial","menino","menos","mensagem","mental","merecer","mergulho","mesada","mesclar","mesmo","mesquita","mestre","metade","meteoro","metragem","mexer","mexicano","micro","migalha","migrar","milagre","milenar","milhar","mimado","minerar","minhoca","ministro","minoria","miolo","mirante","mirtilo","misturar","mocidade","moderno","modular","moeda","moer","moinho","moita","moldura","moleza","molho","molinete","molusco","montanha","moqueca","morango","morcego","mordomo","morena","mosaico","mosquete","mostarda","motel","motim","moto","motriz","muda","muito","mulata","mulher","multar","mundial","munido","muralha","murcho","muscular","museu","musical","nacional","nadador","naja","namoro","narina","narrado","nascer","nativa","natureza","navalha","navegar","navio","neblina","nebuloso","negativa","negociar","negrito","nervoso","neta","neural","nevasca","nevoeiro","ninar","ninho","nitidez","nivelar","nobreza","noite","noiva","nomear","nominal","nordeste","nortear","notar","noticiar","noturno","novelo","novilho","novo","nublado","nudez","numeral","nupcial","nutrir","nuvem","obcecado","obedecer","objetivo","obrigado","obscuro","obstetra","obter","obturar","ocidente","ocioso","ocorrer","oculista","ocupado","ofegante","ofensiva","oferenda","oficina","ofuscado","ogiva","olaria","oleoso","olhar","oliveira","ombro","omelete","omisso","omitir","ondulado","oneroso","ontem","opcional","operador","oponente","oportuno","oposto","orar","orbitar","ordem","ordinal","orfanato","orgasmo","orgulho","oriental","origem","oriundo","orla","ortodoxo","orvalho","oscilar","ossada","osso","ostentar","otimismo","ousadia","outono","outubro","ouvido","ovelha","ovular","oxidar","oxigenar","pacato","paciente","pacote","pactuar","padaria","padrinho","pagar","pagode","painel","pairar","paisagem","palavra","palestra","palheta","palito","palmada","palpitar","pancada","panela","panfleto","panqueca","pantanal","papagaio","papelada","papiro","parafina","parcial","pardal","parede","partida","pasmo","passado","pastel","patamar","patente","patinar","patrono","paulada","pausar","peculiar","pedalar","pedestre","pediatra","pedra","pegada","peitoral","peixe","pele","pelicano","penca","pendurar","peneira","penhasco","pensador","pente","perceber","perfeito","pergunta","perito","permitir","perna","perplexo","persiana","pertence","peruca","pescado","pesquisa","pessoa","petiscar","piada","picado","piedade","pigmento","pilastra","pilhado","pilotar","pimenta","pincel","pinguim","pinha","pinote","pintar","pioneiro","pipoca","piquete","piranha","pires","pirueta","piscar","pistola","pitanga","pivete","planta","plaqueta","platina","plebeu","plumagem","pluvial","pneu","poda","poeira","poetisa","polegada","policiar","poluente","polvilho","pomar","pomba","ponderar","pontaria","populoso","porta","possuir","postal","pote","poupar","pouso","povoar","praia","prancha","prato","praxe","prece","predador","prefeito","premiar","prensar","preparar","presilha","pretexto","prevenir","prezar","primata","princesa","prisma","privado","processo","produto","profeta","proibido","projeto","prometer","propagar","prosa","protetor","provador","publicar","pudim","pular","pulmonar","pulseira","punhal","punir","pupilo","pureza","puxador","quadra","quantia","quarto","quase","quebrar","queda","queijo","quente","querido","quimono","quina","quiosque","rabanada","rabisco","rachar","racionar","radial","raiar","rainha","raio","raiva","rajada","ralado","ramal","ranger","ranhura","rapadura","rapel","rapidez","raposa","raquete","raridade","rasante","rascunho","rasgar","raspador","rasteira","rasurar","ratazana","ratoeira","realeza","reanimar","reaver","rebaixar","rebelde","rebolar","recado","recente","recheio","recibo","recordar","recrutar","recuar","rede","redimir","redonda","reduzida","reenvio","refinar","refletir","refogar","refresco","refugiar","regalia","regime","regra","reinado","reitor","rejeitar","relativo","remador","remendo","remorso","renovado","reparo","repelir","repleto","repolho","represa","repudiar","requerer","resenha","resfriar","resgatar","residir","resolver","respeito","ressaca","restante","resumir","retalho","reter","retirar","retomada","retratar","revelar","revisor","revolta","riacho","rica","rigidez","rigoroso","rimar","ringue","risada","risco","risonho","robalo","rochedo","rodada","rodeio","rodovia","roedor","roleta","romano","roncar","rosado","roseira","rosto","rota","roteiro","rotina","rotular","rouco","roupa","roxo","rubro","rugido","rugoso","ruivo","rumo","rupestre","russo","sabor","saciar","sacola","sacudir","sadio","safira","saga","sagrada","saibro","salada","saleiro","salgado","saliva","salpicar","salsicha","saltar","salvador","sambar","samurai","sanar","sanfona","sangue","sanidade","sapato","sarda","sargento","sarjeta","saturar","saudade","saxofone","sazonal","secar","secular","seda","sedento","sediado","sedoso","sedutor","segmento","segredo","segundo","seiva","seleto","selvagem","semanal","semente","senador","senhor","sensual","sentado","separado","sereia","seringa","serra","servo","setembro","setor","sigilo","silhueta","silicone","simetria","simpatia","simular","sinal","sincero","singular","sinopse","sintonia","sirene","siri","situado","soberano","sobra","socorro","sogro","soja","solda","soletrar","solteiro","sombrio","sonata","sondar","sonegar","sonhador","sono","soprano","soquete","sorrir","sorteio","sossego","sotaque","soterrar","sovado","sozinho","suavizar","subida","submerso","subsolo","subtrair","sucata","sucesso","suco","sudeste","sufixo","sugador","sugerir","sujeito","sulfato","sumir","suor","superior","suplicar","suposto","suprimir","surdina","surfista","surpresa","surreal","surtir","suspiro","sustento","tabela","tablete","tabuada","tacho","tagarela","talher","talo","talvez","tamanho","tamborim","tampa","tangente","tanto","tapar","tapioca","tardio","tarefa","tarja","tarraxa","tatuagem","taurino","taxativo","taxista","teatral","tecer","tecido","teclado","tedioso","teia","teimar","telefone","telhado","tempero","tenente","tensor","tentar","termal","terno","terreno","tese","tesoura","testado","teto","textura","texugo","tiara","tigela","tijolo","timbrar","timidez","tingido","tinteiro","tiragem","titular","toalha","tocha","tolerar","tolice","tomada","tomilho","tonel","tontura","topete","tora","torcido","torneio","torque","torrada","torto","tostar","touca","toupeira","toxina","trabalho","tracejar","tradutor","trafegar","trajeto","trama","trancar","trapo","traseiro","tratador","travar","treino","tremer","trepidar","trevo","triagem","tribo","triciclo","tridente","trilogia","trindade","triplo","triturar","triunfal","trocar","trombeta","trova","trunfo","truque","tubular","tucano","tudo","tulipa","tupi","turbo","turma","turquesa","tutelar","tutorial","uivar","umbigo","unha","unidade","uniforme","urologia","urso","urtiga","urubu","usado","usina","usufruir","vacina","vadiar","vagaroso","vaidoso","vala","valente","validade","valores","vantagem","vaqueiro","varanda","vareta","varrer","vascular","vasilha","vassoura","vazar","vazio","veado","vedar","vegetar","veicular","veleiro","velhice","veludo","vencedor","vendaval","venerar","ventre","verbal","verdade","vereador","vergonha","vermelho","verniz","versar","vertente","vespa","vestido","vetorial","viaduto","viagem","viajar","viatura","vibrador","videira","vidraria","viela","viga","vigente","vigiar","vigorar","vilarejo","vinco","vinheta","vinil","violeta","virada","virtude","visitar","visto","vitral","viveiro","vizinho","voador","voar","vogal","volante","voleibol","voltagem","volumoso","vontade","vulto","vuvuzela","xadrez","xarope","xeque","xeretar","xerife","xingar","zangado","zarpar","zebu","zelador","zombar","zoologia","zumbido"]',
      );
    },
    3776: function (a, e, r) {
      "use strict";
      var o =
        (this && this.__importDefault) ||
        function (a) {
          return a && a.__esModule ? a : { default: a };
        };
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.Decimal = void 0));
      const t = o(r(49)),
        i = 100;
      class Decimal {
        constructor(a, e) {
          this.data = { atomics: new t.default(a), fractionalDigits: e };
        }
        static fromUserInput(a, e) {
          Decimal.verifyFractionalDigits(e);
          const r = a.match(/[^0-9.]/);
          if (r)
            throw new Error("Invalid character at position " + (r.index + 1));
          let o, t;
          if (-1 === a.search(/\./)) ((o = a), (t = ""));
          else {
            const e = a.split(".");
            switch (e.length) {
              case 0:
              case 1:
                throw new Error(
                  "Fewer than two elements in split result. This must not happen here.",
                );
              case 2:
                if (!e[1]) throw new Error("Fractional part missing");
                ((o = e[0]), (t = e[1].replace(/0+$/, "")));
                break;
              default:
                throw new Error("More than one separator found");
            }
          }
          if (t.length > e)
            throw new Error("Got more fractional digits than supported");
          const i = `${o}${t.padEnd(e, "0")}`;
          return new Decimal(i, e);
        }
        static fromAtomics(a, e) {
          return (Decimal.verifyFractionalDigits(e), new Decimal(a, e));
        }
        static verifyFractionalDigits(a) {
          if (!Number.isInteger(a))
            throw new Error("Fractional digits is not an integer");
          if (a < 0) throw new Error("Fractional digits must not be negative");
          if (a > i) throw new Error("Fractional digits must not exceed " + i);
        }
        static compare(a, e) {
          if (a.fractionalDigits !== e.fractionalDigits)
            throw new Error("Fractional digits do not match");
          return a.data.atomics.cmp(new t.default(e.atomics));
        }
        get atomics() {
          return this.data.atomics.toString();
        }
        get fractionalDigits() {
          return this.data.fractionalDigits;
        }
        toString() {
          const a = new t.default(10).pow(
              new t.default(this.data.fractionalDigits),
            ),
            e = this.data.atomics.div(a),
            r = this.data.atomics.mod(a);
          if (r.isZero()) return e.toString();
          {
            const a = r.toString().padStart(this.data.fractionalDigits, "0"),
              o = a.replace(/0+$/, "");
            return `${e.toString()}.${o}`;
          }
        }
        toFloatApproximation() {
          const a = Number(this.toString());
          if (Number.isNaN(a)) throw new Error("Conversion to number failed");
          return a;
        }
        plus(a) {
          if (this.fractionalDigits !== a.fractionalDigits)
            throw new Error("Fractional digits do not match");
          const e = this.data.atomics.add(new t.default(a.atomics));
          return new Decimal(e.toString(), this.fractionalDigits);
        }
        minus(a) {
          if (this.fractionalDigits !== a.fractionalDigits)
            throw new Error("Fractional digits do not match");
          const e = this.data.atomics.sub(new t.default(a.atomics));
          if (e.ltn(0)) throw new Error("Difference must not be negative");
          return new Decimal(e.toString(), this.fractionalDigits);
        }
        multiply(a) {
          const e = this.data.atomics.mul(new t.default(a.toString()));
          return new Decimal(e.toString(), this.fractionalDigits);
        }
        equals(a) {
          return 0 === Decimal.compare(this, a);
        }
        isLessThan(a) {
          return Decimal.compare(this, a) < 0;
        }
        isLessThanOrEqual(a) {
          return Decimal.compare(this, a) <= 0;
        }
        isGreaterThan(a) {
          return Decimal.compare(this, a) > 0;
        }
        isGreaterThanOrEqual(a) {
          return Decimal.compare(this, a) >= 0;
        }
      }
      e.Decimal = Decimal;
    },
    3777: function (a, e, r) {
      "use strict";
      var o =
        (this && this.__importDefault) ||
        function (a) {
          return a && a.__esModule ? a : { default: a };
        };
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.Uint64 = e.Uint53 = e.Int53 = e.Uint32 = void 0));
      const t = o(r(49)),
        i = new t.default("18446744073709551615", 10, "be");
      class Uint32 {
        constructor(a) {
          if (Number.isNaN(a)) throw new Error("Input is not a number");
          if (!Number.isInteger(a)) throw new Error("Input is not an integer");
          if (a < 0 || a > 4294967295)
            throw new Error("Input not in uint32 range: " + a.toString());
          this.data = a;
        }
        static fromBigEndianBytes(a) {
          return Uint32.fromBytes(a);
        }
        static fromBytes(a, e) {
          if ((void 0 === e && (e = "be"), 4 !== a.length))
            throw new Error("Invalid input length. Expected 4 bytes.");
          for (let o = 0; o < a.length; ++o)
            if (!Number.isInteger(a[o]) || a[o] > 255 || a[o] < 0)
              throw new Error("Invalid value in byte. Found: " + a[o]);
          const r = "be" === e ? a : Array.from(a).reverse();
          return new Uint32(r[0] * 2 ** 24 + 65536 * r[1] + 256 * r[2] + r[3]);
        }
        static fromString(a) {
          if (!a.match(/^[0-9]+$/)) throw new Error("Invalid string format");
          return new Uint32(Number.parseInt(a, 10));
        }
        toBytesBigEndian() {
          return new Uint8Array([
            255 & Math.floor(this.data / 2 ** 24),
            255 & Math.floor(this.data / 65536),
            255 & Math.floor(this.data / 256),
            255 & Math.floor(this.data / 1),
          ]);
        }
        toBytesLittleEndian() {
          return new Uint8Array([
            255 & Math.floor(this.data / 1),
            255 & Math.floor(this.data / 256),
            255 & Math.floor(this.data / 65536),
            255 & Math.floor(this.data / 2 ** 24),
          ]);
        }
        toNumber() {
          return this.data;
        }
        toString() {
          return this.data.toString();
        }
      }
      e.Uint32 = Uint32;
      class Int53 {
        constructor(a) {
          if (Number.isNaN(a)) throw new Error("Input is not a number");
          if (!Number.isInteger(a)) throw new Error("Input is not an integer");
          if (a < Number.MIN_SAFE_INTEGER || a > Number.MAX_SAFE_INTEGER)
            throw new Error("Input not in int53 range: " + a.toString());
          this.data = a;
        }
        static fromString(a) {
          if (!a.match(/^-?[0-9]+$/)) throw new Error("Invalid string format");
          return new Int53(Number.parseInt(a, 10));
        }
        toNumber() {
          return this.data;
        }
        toString() {
          return this.data.toString();
        }
      }
      e.Int53 = Int53;
      class Uint53 {
        constructor(a) {
          const e = new Int53(a);
          if (e.toNumber() < 0) throw new Error("Input is negative");
          this.data = e;
        }
        static fromString(a) {
          const e = Int53.fromString(a);
          return new Uint53(e.toNumber());
        }
        toNumber() {
          return this.data.toNumber();
        }
        toString() {
          return this.data.toString();
        }
      }
      e.Uint53 = Uint53;
      class Uint64 {
        constructor(a) {
          if (a.isNeg()) throw new Error("Input is negative");
          if (a.gt(i)) throw new Error("Input exceeds uint64 range");
          this.data = a;
        }
        static fromBytesBigEndian(a) {
          return Uint64.fromBytes(a);
        }
        static fromBytes(a, e) {
          if ((void 0 === e && (e = "be"), 8 !== a.length))
            throw new Error("Invalid input length. Expected 8 bytes.");
          for (let o = 0; o < a.length; ++o)
            if (!Number.isInteger(a[o]) || a[o] > 255 || a[o] < 0)
              throw new Error("Invalid value in byte. Found: " + a[o]);
          const r = "be" === e ? Array.from(a) : Array.from(a).reverse();
          return new Uint64(new t.default(r));
        }
        static fromString(a) {
          if (!a.match(/^[0-9]+$/)) throw new Error("Invalid string format");
          return new Uint64(new t.default(a, 10, "be"));
        }
        static fromNumber(a) {
          if (Number.isNaN(a)) throw new Error("Input is not a number");
          if (!Number.isInteger(a)) throw new Error("Input is not an integer");
          let e;
          try {
            e = new t.default(a);
          } catch (r) {
            throw new Error("Input is not a safe integer");
          }
          return new Uint64(e);
        }
        toBytesBigEndian() {
          return Uint8Array.from(this.data.toArray("be", 8));
        }
        toBytesLittleEndian() {
          return Uint8Array.from(this.data.toArray("le", 8));
        }
        toString() {
          return this.data.toString(10);
        }
        toNumber() {
          return this.data.toNumber();
        }
      }
      e.Uint64 = Uint64;
    },
    3782: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.parseCoins = void 0));
      const o = r(2796);
      function t(a) {
        return a
          .replace(/\s/g, "")
          .split(",")
          .filter(Boolean)
          .map((a) => {
            const e = a.match(/^([0-9]+)([a-zA-Z][a-zA-Z0-9/]{2,127})$/);
            if (!e) throw new Error("Got an invalid coin string");
            return {
              amount: o.Uint64.fromString(e[1]).toString(),
              denom: e[2],
            };
          });
      }
      e.parseCoins = t;
    },
    3783: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.decodeTxRaw = void 0));
      const o = r(2937);
      function t(a) {
        const e = o.TxRaw.decode(a);
        return {
          authInfo: o.AuthInfo.decode(e.authInfoBytes),
          body: o.TxBody.decode(e.bodyBytes),
          signatures: e.signatures,
        };
      }
      e.decodeTxRaw = t;
    },
    3784: function (a, e, r) {
      "use strict";
      (function (a) {
        (Object.defineProperty(e, "__esModule", { value: !0 }),
          (e.Registry =
            e.isTxBodyEncodeObject =
            e.isPbjsGeneratedType =
            e.isTsProtoGeneratedType =
              void 0));
        const o = r(3378),
          t = r(2801),
          i = r(2937),
          n = r(2781);
        function s(a) {
          return "function" === typeof a.fromPartial;
        }
        function c(a) {
          return !s(a);
        }
        ((e.isTsProtoGeneratedType = s), (e.isPbjsGeneratedType = c));
        const l = {
          cosmosCoin: "/cosmos.base.v1beta1.Coin",
          cosmosMsgSend: "/cosmos.bank.v1beta1.MsgSend",
          cosmosTxBody: "/cosmos.tx.v1beta1.TxBody",
          googleAny: "/google.protobuf.Any",
        };
        function u(a) {
          return "/cosmos.tx.v1beta1.TxBody" === a.typeUrl;
        }
        e.isTxBodyEncodeObject = u;
        class Registry {
          constructor(a) {
            void 0 === a && (a = []);
            const { cosmosCoin: e, cosmosMsgSend: r } = l;
            this.types = new Map([[e, t.Coin], [r, o.MsgSend], ...a]);
          }
          register(a, e) {
            this.types.set(a, e);
          }
          lookupType(a) {
            return this.types.get(a);
          }
          lookupTypeWithError(a) {
            const e = this.lookupType(a);
            if (!e) throw new Error("Unregistered type url: " + a);
            return e;
          }
          encode(a) {
            const { value: e, typeUrl: r } = a;
            if (u(a)) return this.encodeTxBody(e);
            const o = this.lookupTypeWithError(r),
              t = s(o) ? o.fromPartial(e) : o.create(e);
            return o.encode(t).finish();
          }
          encodeTxBody(a) {
            const e = a.messages.map((a) => {
                const e = this.encode(a);
                return n.Any.fromPartial({ typeUrl: a.typeUrl, value: e });
              }),
              r = i.TxBody.fromPartial(
                Object.assign(Object.assign({}, a), { messages: e }),
              );
            return i.TxBody.encode(r).finish();
          }
          decode(e) {
            let { typeUrl: r, value: o } = e;
            if (r === l.cosmosTxBody) return this.decodeTxBody(o);
            const t = this.lookupTypeWithError(r),
              i = t.decode(o);
            return (
              Object.entries(i).forEach((e) => {
                let [r, o] = e;
                "undefined" !== typeof a &&
                  "undefined" !== typeof a.isBuffer &&
                  a.isBuffer(o) &&
                  (i[r] = Uint8Array.from(o));
              }),
              i
            );
          }
          decodeTxBody(a) {
            const e = i.TxBody.decode(a);
            return Object.assign(Object.assign({}, e), {
              messages: e.messages.map((a) => {
                let { typeUrl: e, value: r } = a;
                if (!e) throw new Error("Missing type_url in Any");
                if (!r) throw new Error("Missing value in Any");
                return this.decode({ typeUrl: e, value: r });
              }),
            });
          }
        }
        e.Registry = Registry;
      }).call(this, r(2).Buffer);
    },
    3785: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.DirectSecp256k1HdWallet = e.extractKdfConfiguration = void 0));
      const o = r(2910),
        t = r(2800),
        i = r(2762),
        n = r(2815),
        s = r(3119),
        c = r(3322),
        l = "directsecp256k1hdwallet-v1",
        u = {
          algorithm: "argon2id",
          params: { outputLength: 32, opsLimit: 24, memLimitKib: 12288 },
        };
      function d(a) {
        return (
          !!n.isNonNullObject(a) &&
          "string" === typeof a.hdPath &&
          "string" === typeof a.prefix
        );
      }
      function p(a) {
        return a.kdf;
      }
      function m(a) {
        const e = JSON.parse(a);
        if (!n.isNonNullObject(e))
          throw new Error("Root document is not an object.");
        switch (e.type) {
          case l:
            return p(e);
          default:
            throw new Error("Unsupported serialization type");
        }
      }
      e.extractKdfConfiguration = m;
      const f = {
        bip39Password: "",
        hdPaths: [o.makeCosmoshubPath(0)],
        prefix: "cosmos",
      };
      class DirectSecp256k1HdWallet {
        constructor(a, e) {
          var r, o;
          const t = null !== (r = e.prefix) && void 0 !== r ? r : f.prefix,
            i = null !== (o = e.hdPaths) && void 0 !== o ? o : f.hdPaths;
          ((this.secret = a),
            (this.seed = e.seed),
            (this.accounts = i.map((a) => ({ hdPath: a, prefix: t }))));
        }
        static async fromMnemonic(a, e) {
          void 0 === e && (e = {});
          const r = new t.EnglishMnemonic(a),
            o = await t.Bip39.mnemonicToSeed(r, e.bip39Password);
          return new DirectSecp256k1HdWallet(
            r,
            Object.assign(Object.assign({}, e), { seed: o }),
          );
        }
        static async generate(a, e) {
          (void 0 === a && (a = 12), void 0 === e && (e = {}));
          const r = 4 * Math.floor((11 * a) / 33),
            o = t.Random.getBytes(r),
            i = t.Bip39.encode(o);
          return DirectSecp256k1HdWallet.fromMnemonic(i.toString(), e);
        }
        static async deserialize(a, e) {
          const r = JSON.parse(a);
          if (!n.isNonNullObject(r))
            throw new Error("Root document is not an object.");
          switch (r.type) {
            case l:
              return DirectSecp256k1HdWallet.deserializeTypeV1(a, e);
            default:
              throw new Error("Unsupported serialization type");
          }
        }
        static async deserializeWithEncryptionKey(a, e) {
          const r = JSON.parse(a);
          if (!n.isNonNullObject(r))
            throw new Error("Root document is not an object.");
          const o = r;
          switch (o.type) {
            case l: {
              const a = await c.decrypt(i.fromBase64(o.data), e, o.encryption),
                r = JSON.parse(i.fromUtf8(a)),
                { mnemonic: s, accounts: l } = r;
              if ((n.assert("string" === typeof s), !Array.isArray(l)))
                throw new Error("Property 'accounts' is not an array");
              if (!l.every((a) => d(a)))
                throw new Error("Account is not in the correct format.");
              const u = l[0].prefix;
              if (
                !l.every((a) => {
                  let { prefix: e } = a;
                  return e === u;
                })
              )
                throw new Error("Accounts do not all have the same prefix");
              const p = l.map((a) => {
                let { hdPath: e } = a;
                return t.stringToPath(e);
              });
              return DirectSecp256k1HdWallet.fromMnemonic(s, {
                hdPaths: p,
                prefix: u,
              });
            }
            default:
              throw new Error("Unsupported serialization type");
          }
        }
        static async deserializeTypeV1(a, e) {
          const r = JSON.parse(a);
          if (!n.isNonNullObject(r))
            throw new Error("Root document is not an object.");
          const o = await c.executeKdf(e, r.kdf);
          return DirectSecp256k1HdWallet.deserializeWithEncryptionKey(a, o);
        }
        get mnemonic() {
          return this.secret.toString();
        }
        async getAccounts() {
          const a = await this.getAccountsWithPrivkeys();
          return a.map((a) => {
            let { algo: e, pubkey: r, address: o } = a;
            return { algo: e, pubkey: r, address: o };
          });
        }
        async signDirect(a, e) {
          const r = await this.getAccountsWithPrivkeys(),
            i = r.find((e) => {
              let { address: r } = e;
              return r === a;
            });
          if (void 0 === i) throw new Error(`Address ${a} not found in wallet`);
          const { privkey: n, pubkey: c } = i,
            l = s.makeSignBytes(e),
            u = t.sha256(l),
            d = await t.Secp256k1.createSignature(u, n),
            p = new Uint8Array([...d.r(32), ...d.s(32)]),
            m = o.encodeSecp256k1Signature(c, p);
          return { signed: e, signature: m };
        }
        async serialize(a) {
          const e = u,
            r = await c.executeKdf(a, e);
          return this.serializeWithEncryptionKey(r, e);
        }
        async serializeWithEncryptionKey(a, e) {
          const r = {
              mnemonic: this.mnemonic,
              accounts: this.accounts.map((a) => {
                let { hdPath: e, prefix: r } = a;
                return { hdPath: t.pathToString(e), prefix: r };
              }),
            },
            o = i.toUtf8(JSON.stringify(r)),
            n = { algorithm: c.supportedAlgorithms.xchacha20poly1305Ietf },
            s = await c.encrypt(o, a, n),
            u = { type: l, kdf: e, encryption: n, data: i.toBase64(s) };
          return JSON.stringify(u);
        }
        async getKeyPair(a) {
          const { privkey: e } = t.Slip10.derivePath(
              t.Slip10Curve.Secp256k1,
              this.seed,
              a,
            ),
            { pubkey: r } = await t.Secp256k1.makeKeypair(e);
          return { privkey: e, pubkey: t.Secp256k1.compressPubkey(r) };
        }
        async getAccountsWithPrivkeys() {
          return Promise.all(
            this.accounts.map(async (a) => {
              let { hdPath: e, prefix: r } = a;
              const { privkey: t, pubkey: n } = await this.getKeyPair(e),
                s = i.Bech32.encode(r, o.rawSecp256k1PubkeyToRawAddress(n));
              return { algo: "secp256k1", privkey: t, pubkey: n, address: s };
            }),
          );
        }
      }
      e.DirectSecp256k1HdWallet = DirectSecp256k1HdWallet;
    },
    3786: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.DirectSecp256k1Wallet = void 0));
      const o = r(2910),
        t = r(2800),
        i = r(2762),
        n = r(3119);
      class DirectSecp256k1Wallet {
        constructor(a, e, r) {
          ((this.privkey = a), (this.pubkey = e), (this.prefix = r));
        }
        static async fromKey(a, e) {
          void 0 === e && (e = "cosmos");
          const r = (await t.Secp256k1.makeKeypair(a)).pubkey;
          return new DirectSecp256k1Wallet(a, t.Secp256k1.compressPubkey(r), e);
        }
        get address() {
          return i.Bech32.encode(
            this.prefix,
            o.rawSecp256k1PubkeyToRawAddress(this.pubkey),
          );
        }
        async getAccounts() {
          return [
            { algo: "secp256k1", address: this.address, pubkey: this.pubkey },
          ];
        }
        async signDirect(a, e) {
          const r = n.makeSignBytes(e);
          if (a !== this.address)
            throw new Error(`Address ${a} not found in wallet`);
          const i = t.sha256(r),
            s = await t.Secp256k1.createSignature(i, this.privkey),
            c = new Uint8Array([...s.r(32), ...s.s(32)]),
            l = o.encodeSecp256k1Signature(this.pubkey, c);
          return { signed: e, signature: l };
        }
      }
      e.DirectSecp256k1Wallet = DirectSecp256k1Wallet;
    },
    3787: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.makeCosmoshubPath = void 0));
      const o = r(2800);
      function t(a) {
        return [
          o.Slip10RawIndex.hardened(44),
          o.Slip10RawIndex.hardened(118),
          o.Slip10RawIndex.hardened(0),
          o.Slip10RawIndex.normal(0),
          o.Slip10RawIndex.normal(a),
        ];
      }
      e.makeCosmoshubPath = t;
    },
    3788: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.decodePubkey = e.encodePubkey = void 0));
      const o = r(2910),
        t = r(2762),
        i = r(2796),
        n = r(3789),
        s = r(3790),
        c = r(2781);
      function l(a) {
        if (o.isSecp256k1Pubkey(a)) {
          const e = s.PubKey.fromPartial({ key: t.fromBase64(a.value) });
          return c.Any.fromPartial({
            typeUrl: "/cosmos.crypto.secp256k1.PubKey",
            value: Uint8Array.from(s.PubKey.encode(e).finish()),
          });
        }
        if (o.isMultisigThresholdPubkey(a)) {
          const e = n.LegacyAminoPubKey.fromPartial({
            threshold: i.Uint53.fromString(a.value.threshold).toNumber(),
            publicKeys: a.value.pubkeys.map(l),
          });
          return c.Any.fromPartial({
            typeUrl: "/cosmos.crypto.multisig.LegacyAminoPubKey",
            value: Uint8Array.from(n.LegacyAminoPubKey.encode(e).finish()),
          });
        }
        throw new Error(`Pubkey type ${a.type} not recognized`);
      }
      function u(a) {
        switch (a.typeUrl) {
          case "/cosmos.crypto.secp256k1.PubKey": {
            const { key: e } = s.PubKey.decode(a.value);
            return o.encodeSecp256k1Pubkey(e);
          }
          default:
            throw new Error(
              `Pubkey type_url ${a.typeUrl} not recognized as single public key type`,
            );
        }
      }
      function d(a) {
        if (!a || !a.value) return null;
        switch (a.typeUrl) {
          case "/cosmos.crypto.secp256k1.PubKey":
            return u(a);
          case "/cosmos.crypto.multisig.LegacyAminoPubKey": {
            const { threshold: e, publicKeys: r } = n.LegacyAminoPubKey.decode(
                a.value,
              ),
              o = {
                type: "tendermint/PubKeyMultisigThreshold",
                value: { threshold: e.toString(), pubkeys: r.map(u) },
              };
            return o;
          }
          default:
            throw new Error(`Pubkey type_url ${a.typeUrl} not recognized`);
        }
      }
      ((e.encodePubkey = l), (e.decodePubkey = d));
    },
    3791: function (a, e, r) {
      "use strict";
      function o(a) {
        return void 0 !== a.signDirect;
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.isOfflineDirectSigner = void 0),
        (e.isOfflineDirectSigner = o));
    },
    4448: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.makeJsonRpcId = void 0));
      let o = 1e4;
      function t() {
        return (o += 1);
      }
      e.makeJsonRpcId = t;
    },
    4449: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.JsonRpcClient = void 0));
      const o = r(3154),
        t = r(3579);
      class JsonRpcClient {
        constructor(a) {
          this.connection = a;
        }
        async run(a) {
          const e = this.connection.responseStream.filter((e) => e.id === a.id),
            r = o.firstEvent(e);
          this.connection.sendRequest(a);
          const i = await r;
          if (t.isJsonRpcErrorResponse(i)) {
            const a = i.error;
            throw new Error(
              `JSON RPC error: code=${a.code}; message='${a.message}'`,
            );
          }
          return i;
        }
      }
      e.JsonRpcClient = JsonRpcClient;
    },
    4450: function (a, e, r) {
      "use strict";
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.parseJsonRpcResponse =
          e.parseJsonRpcSuccessResponse =
          e.parseJsonRpcErrorResponse =
          e.parseJsonRpcRequest =
          e.parseJsonRpcId =
            void 0));
      const o = r(4451);
      function t(a) {
        if (!o.isJsonCompatibleDictionary(a))
          throw new Error("Data must be JSON compatible dictionary");
        const e = a.id;
        return "number" !== typeof e && "string" !== typeof e ? null : e;
      }
      function i(a) {
        if (!o.isJsonCompatibleDictionary(a))
          throw new Error("Data must be JSON compatible dictionary");
        if ("2.0" !== a.jsonrpc)
          throw new Error("Got unexpected jsonrpc version: " + a.jsonrpc);
        const e = t(a);
        if (null === e) throw new Error("Invalid id field");
        const r = a.method;
        if ("string" !== typeof r) throw new Error("Invalid method field");
        if (
          !o.isJsonCompatibleArray(a.params) &&
          !o.isJsonCompatibleDictionary(a.params)
        )
          throw new Error("Invalid params field");
        return { jsonrpc: "2.0", id: e, method: r, params: a.params };
      }
      function n(a) {
        if ("number" !== typeof a.code)
          throw new Error("Error property 'code' is not a number");
        if ("string" !== typeof a.message)
          throw new Error("Error property 'message' is not a string");
        let e;
        if (void 0 === a.data) e = void 0;
        else {
          if (!o.isJsonCompatibleValue(a.data))
            throw new Error(
              "Error property 'data' is defined but not a JSON compatible value.",
            );
          e = a.data;
        }
        return Object.assign(
          { code: a.code, message: a.message },
          void 0 !== e ? { data: e } : {},
        );
      }
      function s(a) {
        if (!o.isJsonCompatibleDictionary(a))
          throw new Error("Data must be JSON compatible dictionary");
        if ("2.0" !== a.jsonrpc)
          throw new Error(
            "Got unexpected jsonrpc version: " + JSON.stringify(a),
          );
        const e = a.id;
        if ("number" !== typeof e && "string" !== typeof e && null !== e)
          throw new Error("Invalid id field");
        if (
          "undefined" === typeof a.error ||
          !o.isJsonCompatibleDictionary(a.error)
        )
          throw new Error("Invalid error field");
        return { jsonrpc: "2.0", id: e, error: n(a.error) };
      }
      function c(a) {
        if (!o.isJsonCompatibleDictionary(a))
          throw new Error("Data must be JSON compatible dictionary");
        if ("2.0" !== a.jsonrpc)
          throw new Error(
            "Got unexpected jsonrpc version: " + JSON.stringify(a),
          );
        const e = a.id;
        if ("number" !== typeof e && "string" !== typeof e)
          throw new Error("Invalid id field");
        if ("undefined" === typeof a.result)
          throw new Error("Invalid result field");
        const r = a.result;
        return { jsonrpc: "2.0", id: e, result: r };
      }
      function l(a) {
        let e;
        try {
          e = s(a);
        } catch (r) {
          e = c(a);
        }
        return e;
      }
      ((e.parseJsonRpcId = t),
        (e.parseJsonRpcRequest = i),
        (e.parseJsonRpcErrorResponse = s),
        (e.parseJsonRpcSuccessResponse = c),
        (e.parseJsonRpcResponse = l));
    },
    4451: function (a, e, r) {
      "use strict";
      function o(a) {
        return !(
          "string" !== typeof a &&
          "number" !== typeof a &&
          "boolean" !== typeof a &&
          null !== a &&
          !t(a) &&
          !i(a)
        );
      }
      function t(a) {
        if (!Array.isArray(a)) return !1;
        for (const e of a) if (!o(e)) return !1;
        return !0;
      }
      function i(a) {
        if ("object" !== typeof a || null === a) return !1;
        if ("[object Object]" !== Object.prototype.toString.call(a)) return !1;
        const e = Object.getOwnPropertyNames(a).map((e) => a[e]);
        return e.every(o);
      }
      (Object.defineProperty(e, "__esModule", { value: !0 }),
        (e.isJsonCompatibleDictionary =
          e.isJsonCompatibleArray =
          e.isJsonCompatibleValue =
            void 0),
        (e.isJsonCompatibleValue = o),
        (e.isJsonCompatibleArray = t),
        (e.isJsonCompatibleDictionary = i));
    },
  },
]);
